ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32L5xx/stm32l552xx.h
/*!< FMC Banks Non secure registers base  address */
#define FMC_Bank1_R_BASE_NS   (FMC_R_BASE_NS + 0x0000UL)
#define FMC_Bank1E_R_BASE_NS  (FMC_R_BASE_NS + 0x0104UL)
#define FMC_Bank3_R_BASE_NS   (FMC_R_BASE_NS + 0x0080UL)

/* Flash, Peripheral and internal SRAMs base addresses - Secure aliased */
#define FLASH_BASE_S          (0x0C000000UL) /*!< FLASH(up to 512 KB) base address */
#define SRAM1_BASE_S          (0x30000000UL) /*!< SRAM1(up to 192 KB) base address */
#define SRAM2_BASE_S          (0x30030000UL) /*!< SRAM2(64 KB) base address */
#define SRAM_BASE_S           SRAM1_BASE_S
#define PERIPH_BASE_S         (0x50000000UL) /*!< Peripheral secure base address */

/* Peripheral memory map - Secure */
#define APB1PERIPH_BASE_S     PERIPH_BASE_S
#define APB2PERIPH_BASE_S     (PERIPH_BASE_S + 0x00010000UL)
#define AHB1PERIPH_BASE_S     (PERIPH_BASE_S + 0x00020000UL)
#define AHB2PERIPH_BASE_S     (PERIPH_BASE_S + 0x02020000UL)
#define AHB3PERIPH_BASE_S     (PERIPH_BASE_S + 0x04020000UL)

/*!< APB1 Secure peripherals */
#define TIM2_BASE_S           (APB1PERIPH_BASE_S + 0x0000UL)
#define TIM3_BASE_S           (APB1PERIPH_BASE_S + 0x0400UL)
#define TIM4_BASE_S           (APB1PERIPH_BASE_S + 0x0800UL)
#define TIM5_BASE_S           (APB1PERIPH_BASE_S + 0x0C00UL)
#define TIM6_BASE_S           (APB1PERIPH_BASE_S + 0x1000UL)
#define TIM7_BASE_S           (APB1PERIPH_BASE_S + 0x1400UL)
#define RTC_BASE_S            (APB1PERIPH_BASE_S + 0x2800UL)
#define WWDG_BASE_S           (APB1PERIPH_BASE_S + 0x2C00UL)
#define IWDG_BASE_S           (APB1PERIPH_BASE_S + 0x3000UL)
#define TAMP_BASE_S           (APB1PERIPH_BASE_S + 0x3400UL)
#define SPI2_BASE_S           (APB1PERIPH_BASE_S + 0x3800UL)
#define SPI3_BASE_S           (APB1PERIPH_BASE_S + 0x3C00UL)
#define USART2_BASE_S         (APB1PERIPH_BASE_S + 0x4400UL)
#define USART3_BASE_S         (APB1PERIPH_BASE_S + 0x4800UL)
#define UART4_BASE_S          (APB1PERIPH_BASE_S + 0x4C00UL)
#define UART5_BASE_S          (APB1PERIPH_BASE_S + 0x5000UL)
#define I2C1_BASE_S           (APB1PERIPH_BASE_S + 0x5400UL)
#define I2C2_BASE_S           (APB1PERIPH_BASE_S + 0x5800UL)
#define I2C3_BASE_S           (APB1PERIPH_BASE_S + 0x5C00UL)
#define CRS_BASE_S            (APB1PERIPH_BASE_S + 0x6000UL)
#define PWR_BASE_S            (APB1PERIPH_BASE_S + 0x7000UL)
#define DAC_BASE_S            (APB1PERIPH_BASE_S + 0x7400UL)
#define DAC1_BASE_S           (APB1PERIPH_BASE_S + 0x7400UL)
#define OPAMP_BASE_S          (APB1PERIPH_BASE_S + 0x7800UL)
#define OPAMP1_BASE_S         (APB1PERIPH_BASE_S + 0x7800UL)
#define OPAMP2_BASE_S         (APB1PERIPH_BASE_S + 0x7810UL)
#define LPTIM1_BASE_S         (APB1PERIPH_BASE_S + 0x7C00UL)
#define LPUART1_BASE_S        (APB1PERIPH_BASE_S + 0x8000UL)
#define I2C4_BASE_S           (APB1PERIPH_BASE_S + 0x8400UL)
#define LPTIM2_BASE_S         (APB1PERIPH_BASE_S + 0x9400UL)
#define LPTIM3_BASE_S         (APB1PERIPH_BASE_S + 0x9800UL)
#define FDCAN1_BASE_S         (APB1PERIPH_BASE_S + 0xA400UL)
#define FDCAN_CONFIG_BASE_S   (APB1PERIPH_BASE_S + 0xA500UL)
#define SRAMCAN_BASE_S        (APB1PERIPH_BASE_S + 0xAC00UL)
#define USB_BASE_S            (APB1PERIPH_BASE_S + 0xD400UL)  /*!< USB_IP Peripheral Registers base address */
#define USB_PMAADDR_S         (APB1PERIPH_BASE_S + 0xD800UL)  /*!< USB_IP Packet Memory Area base address */
#define UCPD1_BASE_S          (APB1PERIPH_BASE_S + 0xDC00UL)

/*!< APB2 Secure peripherals */
#define SYSCFG_BASE_S         (APB2PERIPH_BASE_S + 0x0000UL)
#define VREFBUF_BASE_S        (APB2PERIPH_BASE_S + 0x0100UL)
#define COMP1_BASE_S          (APB2PERIPH_BASE_S + 0x0200UL)
#define COMP2_BASE_S          (APB2PERIPH_BASE_S + 0x0204UL)
#define TIM1_BASE_S           (APB2PERIPH_BASE_S + 0x2C00UL)
#define SPI1_BASE_S           (APB2PERIPH_BASE_S + 0x3000UL)
#define TIM8_BASE_S           (APB2PERIPH_BASE_S + 0x3400UL)
#define USART1_BASE_S         (APB2PERIPH_BASE_S + 0x3800UL)
#define TIM15_BASE_S          (APB2PERIPH_BASE_S + 0x4000UL)
#define TIM16_BASE_S          (APB2PERIPH_BASE_S + 0x4400UL)
#define TIM17_BASE_S          (APB2PERIPH_BASE_S + 0x4800UL)
#define SAI1_BASE_S           (APB2PERIPH_BASE_S + 0x5400UL)
#define SAI1_Block_A_BASE_S   (SAI1_BASE_S + 0x0004UL)
#define SAI1_Block_B_BASE_S   (SAI1_BASE_S + 0x0024UL)
#define SAI2_BASE_S           (APB2PERIPH_BASE_S + 0x5800UL)
#define SAI2_Block_A_BASE_S   (SAI2_BASE_S + 0x0004UL)
#define SAI2_Block_B_BASE_S   (SAI2_BASE_S + 0x0024UL)
#define DFSDM1_BASE_S         (APB2PERIPH_BASE_S + 0x6000UL)
#define DFSDM1_Channel0_BASE_S (DFSDM1_BASE_S + 0x0000UL)
#define DFSDM1_Channel1_BASE_S (DFSDM1_BASE_S + 0x0020UL)
#define DFSDM1_Channel2_BASE_S (DFSDM1_BASE_S + 0x0040UL)
#define DFSDM1_Channel3_BASE_S (DFSDM1_BASE_S + 0x0060UL)
#define DFSDM1_Filter0_BASE_S  (DFSDM1_BASE_S + 0x0100UL)
#define DFSDM1_Filter1_BASE_S  (DFSDM1_BASE_S + 0x0180UL)
#define DFSDM1_Filter2_BASE_S  (DFSDM1_BASE_S + 0x0200UL)
#define DFSDM1_Filter3_BASE_S  (DFSDM1_BASE_S + 0x0280UL)

/*!< AHB1 Secure peripherals */
#define DMA1_BASE_S           (AHB1PERIPH_BASE_S)
#define DMA2_BASE_S           (AHB1PERIPH_BASE_S + 0x0400UL)
#define DMAMUX1_BASE_S        (AHB1PERIPH_BASE_S + 0x0800UL)
#define RCC_BASE_S            (AHB1PERIPH_BASE_S + 0x1000UL)
#define FLASH_R_BASE_S        (AHB1PERIPH_BASE_S + 0x2000UL)
#define CRC_BASE_S            (AHB1PERIPH_BASE_S + 0x3000UL)
#define TSC_BASE_S            (AHB1PERIPH_BASE_S + 0x4000UL)
#define EXTI_BASE_S           (AHB1PERIPH_BASE_S + 0xF400UL)
#define ICACHE_BASE_S         (AHB1PERIPH_BASE_S + 0x10400UL)
#define GTZC_TZSC_BASE_S      (AHB1PERIPH_BASE_S + 0x12400UL)
#define GTZC_TZIC_BASE_S      (AHB1PERIPH_BASE_S + 0x12800UL)
#define GTZC_MPCBB1_BASE_S    (AHB1PERIPH_BASE_S + 0x12C00UL)
#define GTZC_MPCBB2_BASE_S    (AHB1PERIPH_BASE_S + 0x13000UL)

#define DMA1_Channel1_BASE_S  (DMA1_BASE_S + 0x0008UL)
#define DMA1_Channel2_BASE_S  (DMA1_BASE_S + 0x001CUL)
#define DMA1_Channel3_BASE_S  (DMA1_BASE_S + 0x0030UL)
#define DMA1_Channel4_BASE_S  (DMA1_BASE_S + 0x0044UL)
#define DMA1_Channel5_BASE_S  (DMA1_BASE_S + 0x0058UL)
#define DMA1_Channel6_BASE_S  (DMA1_BASE_S + 0x006CUL)
#define DMA1_Channel7_BASE_S  (DMA1_BASE_S + 0x0080UL)
#define DMA1_Channel8_BASE_S  (DMA1_BASE_S + 0x0094UL)

