ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32L5xx/stm32l552xx.h
/** @addtogroup STM32L5xx_Peripheral_declaration
  * @{
  */

/*!< APB1 Non secure peripherals */
#define TIM2_NS             ((TIM_TypeDef *) TIM2_BASE_NS)
#define TIM3_NS             ((TIM_TypeDef *) TIM3_BASE_NS)
#define TIM4_NS             ((TIM_TypeDef *) TIM4_BASE_NS)
#define TIM5_NS             ((TIM_TypeDef *) TIM5_BASE_NS)
#define TIM6_NS             ((TIM_TypeDef *) TIM6_BASE_NS)
#define TIM7_NS             ((TIM_TypeDef *) TIM7_BASE_NS)
#define RTC_NS              ((RTC_TypeDef *) RTC_BASE_NS)
#define WWDG_NS             ((WWDG_TypeDef *) WWDG_BASE_NS)
#define IWDG_NS             ((IWDG_TypeDef *) IWDG_BASE_NS)
#define TAMP_NS             ((TAMP_TypeDef *) TAMP_BASE_NS)
#define SPI2_NS             ((SPI_TypeDef *) SPI2_BASE_NS)
#define SPI3_NS             ((SPI_TypeDef *) SPI3_BASE_NS)
#define USART2_NS           ((USART_TypeDef *) USART2_BASE_NS)
#define USART3_NS           ((USART_TypeDef *) USART3_BASE_NS)
#define UART4_NS            ((USART_TypeDef *) UART4_BASE_NS)
#define UART5_NS            ((USART_TypeDef *) UART5_BASE_NS)
#define I2C1_NS             ((I2C_TypeDef *) I2C1_BASE_NS)
#define I2C2_NS             ((I2C_TypeDef *) I2C2_BASE_NS)
#define I2C3_NS             ((I2C_TypeDef *) I2C3_BASE_NS)
#define CRS_NS              ((CRS_TypeDef *) CRS_BASE_NS)
#define FDCAN1_NS           ((FDCAN_GlobalTypeDef *) FDCAN1_BASE_NS)
#define FDCAN_CONFIG_NS     ((FDCAN_Config_TypeDef *) FDCAN_CONFIG_BASE_NS)
#define I2C4_NS             ((I2C_TypeDef *) I2C4_BASE_NS)
#define PWR_NS              ((PWR_TypeDef *) PWR_BASE_NS)
#define DAC_NS              ((DAC_TypeDef *) DAC1_BASE_NS)
#define DAC1_NS             ((DAC_TypeDef *) DAC1_BASE_NS)
#define OPAMP_NS            ((OPAMP_TypeDef *) OPAMP_BASE_NS)
#define OPAMP1_NS           ((OPAMP_TypeDef *) OPAMP1_BASE_NS)
#define OPAMP2_NS           ((OPAMP_TypeDef *) OPAMP2_BASE_NS)
#define OPAMP12_COMMON_NS   ((OPAMP_Common_TypeDef *) OPAMP1_BASE_NS)
#define LPTIM1_NS           ((LPTIM_TypeDef *) LPTIM1_BASE_NS)
#define LPUART1_NS          ((USART_TypeDef *) LPUART1_BASE_NS)
#define LPTIM2_NS           ((LPTIM_TypeDef *) LPTIM2_BASE_NS)
#define LPTIM3_NS           ((LPTIM_TypeDef *) LPTIM3_BASE_NS)
#define USB_NS              ((USB_TypeDef *) USB_BASE_NS)
#define UCPD1_NS            ((UCPD_TypeDef *) UCPD1_BASE_NS)

/*!< APB2 Non secure peripherals */
#define SYSCFG_NS           ((SYSCFG_TypeDef *) SYSCFG_BASE_NS)
#define VREFBUF_NS          ((VREFBUF_TypeDef *) VREFBUF_BASE_NS)
#define COMP1_NS            ((COMP_TypeDef *) COMP1_BASE_NS)
#define COMP2_NS            ((COMP_TypeDef *) COMP2_BASE_NS)
#define COMP12_COMMON_NS    ((COMP_Common_TypeDef *) COMP2_BASE_NS)
#define TIM1_NS             ((TIM_TypeDef *) TIM1_BASE_NS)
#define SPI1_NS             ((SPI_TypeDef *) SPI1_BASE_NS)
#define TIM8_NS             ((TIM_TypeDef *) TIM8_BASE_NS)
#define USART1_NS           ((USART_TypeDef *) USART1_BASE_NS)
#define TIM15_NS            ((TIM_TypeDef *) TIM15_BASE_NS)
#define TIM16_NS            ((TIM_TypeDef *) TIM16_BASE_NS)
#define TIM17_NS            ((TIM_TypeDef *) TIM17_BASE_NS)
#define SAI1_NS             ((SAI_TypeDef *) SAI1_BASE_NS)
#define SAI1_Block_A_NS     ((SAI_Block_TypeDef *)SAI1_Block_A_BASE_NS)
#define SAI1_Block_B_NS     ((SAI_Block_TypeDef *)SAI1_Block_B_BASE_NS)
#define SAI2_NS             ((SAI_TypeDef *) SAI2_BASE_NS)
#define SAI2_Block_A_NS     ((SAI_Block_TypeDef *)SAI2_Block_A_BASE_NS)
#define SAI2_Block_B_NS     ((SAI_Block_TypeDef *)SAI2_Block_B_BASE_NS)
#define DFSDM1_Channel0_NS  ((DFSDM_Channel_TypeDef *) DFSDM1_Channel0_BASE_NS)
#define DFSDM1_Channel1_NS  ((DFSDM_Channel_TypeDef *) DFSDM1_Channel1_BASE_NS)
#define DFSDM1_Channel2_NS  ((DFSDM_Channel_TypeDef *) DFSDM1_Channel2_BASE_NS)
#define DFSDM1_Channel3_NS  ((DFSDM_Channel_TypeDef *) DFSDM1_Channel3_BASE_NS)
#define DFSDM1_Filter0_NS   ((DFSDM_Filter_TypeDef *) DFSDM1_Filter0_BASE_NS)
#define DFSDM1_Filter1_NS   ((DFSDM_Filter_TypeDef *) DFSDM1_Filter1_BASE_NS)
#define DFSDM1_Filter2_NS   ((DFSDM_Filter_TypeDef *) DFSDM1_Filter2_BASE_NS)
#define DFSDM1_Filter3_NS   ((DFSDM_Filter_TypeDef *) DFSDM1_Filter3_BASE_NS)

/*!< AHB1 Non secure peripherals */
#define DMA1_NS             ((DMA_TypeDef *) DMA1_BASE_NS)
#define DMA2_NS             ((DMA_TypeDef *) DMA2_BASE_NS)
#define DMAMUX1_NS          ((DMAMUX_Channel_TypeDef *) DMAMUX1_BASE_NS)
#define RCC_NS              ((RCC_TypeDef *) RCC_BASE_NS)
#define FLASH_NS            ((FLASH_TypeDef *) FLASH_R_BASE_NS)
#define CRC_NS              ((CRC_TypeDef *) CRC_BASE_NS)
#define TSC_NS              ((TSC_TypeDef *) TSC_BASE_NS)
#define EXTI_NS             ((EXTI_TypeDef *) EXTI_BASE_NS)
#define ICACHE_NS           ((ICACHE_TypeDef *) ICACHE_BASE_NS)
#define GTZC_TZSC_NS        ((GTZC_TZSC_TypeDef *) GTZC_TZSC_BASE_NS)
#define GTZC_TZIC_NS        ((GTZC_TZIC_TypeDef *) GTZC_TZIC_BASE_NS)
#define GTZC_MPCBB2_NS      ((GTZC_MPCBB_TypeDef *) GTZC_MPCBB2_BASE_NS)
#define GTZC_MPCBB1_NS      ((GTZC_MPCBB_TypeDef *) GTZC_MPCBB1_BASE_NS)

#define DMA1_Channel1_NS    ((DMA_Channel_TypeDef *) DMA1_Channel1_BASE_NS)
#define DMA1_Channel2_NS    ((DMA_Channel_TypeDef *) DMA1_Channel2_BASE_NS)
#define DMA1_Channel3_NS    ((DMA_Channel_TypeDef *) DMA1_Channel3_BASE_NS)
#define DMA1_Channel4_NS    ((DMA_Channel_TypeDef *) DMA1_Channel4_BASE_NS)
#define DMA1_Channel5_NS    ((DMA_Channel_TypeDef *) DMA1_Channel5_BASE_NS)
#define DMA1_Channel6_NS    ((DMA_Channel_TypeDef *) DMA1_Channel6_BASE_NS)
#define DMA1_Channel7_NS    ((DMA_Channel_TypeDef *) DMA1_Channel7_BASE_NS)
#define DMA1_Channel8_NS    ((DMA_Channel_TypeDef *) DMA1_Channel8_BASE_NS)

#define DMA2_Channel1_NS    ((DMA_Channel_TypeDef *) DMA2_Channel1_BASE_NS)
#define DMA2_Channel2_NS    ((DMA_Channel_TypeDef *) DMA2_Channel2_BASE_NS)
#define DMA2_Channel3_NS    ((DMA_Channel_TypeDef *) DMA2_Channel3_BASE_NS)
#define DMA2_Channel4_NS    ((DMA_Channel_TypeDef *) DMA2_Channel4_BASE_NS)
#define DMA2_Channel5_NS    ((DMA_Channel_TypeDef *) DMA2_Channel5_BASE_NS)
#define DMA2_Channel6_NS    ((DMA_Channel_TypeDef *) DMA2_Channel6_BASE_NS)
#define DMA2_Channel7_NS    ((DMA_Channel_TypeDef *) DMA2_Channel7_BASE_NS)
#define DMA2_Channel8_NS    ((DMA_Channel_TypeDef *) DMA2_Channel8_BASE_NS)

#define DMAMUX1_Channel0_NS  ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel0_BASE_NS)
#define DMAMUX1_Channel1_NS  ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel1_BASE_NS)
#define DMAMUX1_Channel2_NS  ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel2_BASE_NS)
#define DMAMUX1_Channel3_NS  ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel3_BASE_NS)
#define DMAMUX1_Channel4_NS  ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel4_BASE_NS)
#define DMAMUX1_Channel5_NS  ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel5_BASE_NS)
#define DMAMUX1_Channel6_NS  ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel6_BASE_NS)
#define DMAMUX1_Channel7_NS  ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel7_BASE_NS)
#define DMAMUX1_Channel8_NS  ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel8_BASE_NS)
#define DMAMUX1_Channel9_NS  ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel9_BASE_NS)
#define DMAMUX1_Channel10_NS ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel10_BASE_NS)
#define DMAMUX1_Channel11_NS ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel11_BASE_NS)
#define DMAMUX1_Channel12_NS ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel12_BASE_NS)
#define DMAMUX1_Channel13_NS ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel13_BASE_NS)
#define DMAMUX1_Channel14_NS ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel14_BASE_NS)
#define DMAMUX1_Channel15_NS ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel15_BASE_NS)

#define DMAMUX1_RequestGenerator0_NS ((DMAMUX_RequestGen_TypeDef *) DMAMUX1_RequestGenerator0_BASE_NS)
#define DMAMUX1_RequestGenerator1_NS ((DMAMUX_RequestGen_TypeDef *) DMAMUX1_RequestGenerator1_BASE_NS)
#define DMAMUX1_RequestGenerator2_NS ((DMAMUX_RequestGen_TypeDef *) DMAMUX1_RequestGenerator2_BASE_NS)
#define DMAMUX1_RequestGenerator3_NS ((DMAMUX_RequestGen_TypeDef *) DMAMUX1_RequestGenerator3_BASE_NS)

