ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32L5xx/stm32l552xx.h
/*!< Memory & Instance aliases and base addresses for Non-Secure/Secure peripherals */

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)

/*!< Memory base addresses for Secure peripherals */
#define FLASH_BASE                     FLASH_BASE_S
#define SRAM1_BASE                     SRAM1_BASE_S
#define SRAM2_BASE                     SRAM2_BASE_S
#define SRAM_BASE                      SRAM1_BASE_S
#define PERIPH_BASE                    PERIPH_BASE_S
#define APB1PERIPH_BASE                APB1PERIPH_BASE_S
#define APB2PERIPH_BASE                APB2PERIPH_BASE_S
#define AHB1PERIPH_BASE                AHB1PERIPH_BASE_S
#define AHB2PERIPH_BASE                AHB2PERIPH_BASE_S
#define AHB3PERIPH_BASE                AHB3PERIPH_BASE_S

/*!< Instance aliases and base addresses for Secure peripherals */
#define RCC                            RCC_S
#define RCC_BASE                       RCC_BASE_S

#define FLASH                          FLASH_S
#define FLASH_R_BASE                   FLASH_R_BASE_S

#define DMA1                           DMA1_S
#define DMA1_BASE                      DMA1_BASE_S

#define DMA1_Channel1                  DMA1_Channel1_S
#define DMA1_Channel1_BASE             DMA1_Channel1_BASE_S

#define DMA1_Channel2                  DMA1_Channel2_S
#define DMA1_Channel2_BASE             DMA1_Channel2_BASE_S

#define DMA1_Channel3                  DMA1_Channel3_S
#define DMA1_Channel3_BASE             DMA1_Channel3_BASE_S

#define DMA1_Channel4                  DMA1_Channel4_S
#define DMA1_Channel4_BASE             DMA1_Channel4_BASE_S

#define DMA1_Channel5                  DMA1_Channel5_S
#define DMA1_Channel5_BASE             DMA1_Channel5_BASE_S

#define DMA1_Channel6                  DMA1_Channel6_S
#define DMA1_Channel6_BASE             DMA1_Channel6_BASE_S

#define DMA1_Channel7                  DMA1_Channel7_S
#define DMA1_Channel7_BASE             DMA1_Channel7_BASE_S

#define DMA1_Channel8                  DMA1_Channel8_S
#define DMA1_Channel8_BASE             DMA1_Channel8_BASE_S

#define DMA2                           DMA2_S
#define DMA2_BASE                      DMA2_BASE_S

#define DMA2_Channel1                  DMA2_Channel1_S
#define DMA2_Channel1_BASE             DMA2_Channel1_BASE_S

#define DMA2_Channel2                  DMA2_Channel2_S
#define DMA2_Channel2_BASE             DMA2_Channel2_BASE_S

#define DMA2_Channel3                  DMA2_Channel3_S
#define DMA2_Channel3_BASE             DMA2_Channel3_BASE_S

#define DMA2_Channel4                  DMA2_Channel4_S
#define DMA2_Channel4_BASE             DMA2_Channel4_BASE_S

#define DMA2_Channel5                  DMA2_Channel5_S
#define DMA2_Channel5_BASE             DMA2_Channel5_BASE_S

#define DMA2_Channel6                  DMA2_Channel6_S
#define DMA2_Channel6_BASE             DMA2_Channel6_BASE_S

#define DMA2_Channel7                  DMA2_Channel7_S
#define DMA2_Channel7_BASE             DMA2_Channel7_BASE_S

#define DMA2_Channel8                  DMA2_Channel8_S
#define DMA2_Channel8_BASE             DMA2_Channel8_BASE_S

#define DMAMUX1                        DMAMUX1_S
#define DMAMUX1_BASE                   DMAMUX1_BASE_S

#define DMAMUX1_Channel0               DMAMUX1_Channel0_S
#define DMAMUX1_Channel0_BASE          DMAMUX1_Channel0_BASE_S

#define DMAMUX1_Channel1               DMAMUX1_Channel1_S
#define DMAMUX1_Channel1_BASE          DMAMUX1_Channel1_BASE_S

#define DMAMUX1_Channel2               DMAMUX1_Channel2_S
#define DMAMUX1_Channel2_BASE          DMAMUX1_Channel2_BASE_S

#define DMAMUX1_Channel3               DMAMUX1_Channel3_S
#define DMAMUX1_Channel3_BASE          DMAMUX1_Channel3_BASE_S

#define DMAMUX1_Channel4               DMAMUX1_Channel4_S
#define DMAMUX1_Channel4_BASE          DMAMUX1_Channel4_BASE_S

#define DMAMUX1_Channel5               DMAMUX1_Channel5_S
#define DMAMUX1_Channel5_BASE          DMAMUX1_Channel5_BASE_S

#define DMAMUX1_Channel6               DMAMUX1_Channel6_S
#define DMAMUX1_Channel6_BASE          DMAMUX1_Channel6_BASE_S

#define DMAMUX1_Channel7               DMAMUX1_Channel7_S
#define DMAMUX1_Channel7_BASE          DMAMUX1_Channel7_BASE_S

#define DMAMUX1_Channel8               DMAMUX1_Channel8_S
#define DMAMUX1_Channel8_BASE          DMAMUX1_Channel8_BASE_S

#define DMAMUX1_Channel9               DMAMUX1_Channel9_S
#define DMAMUX1_Channel9_BASE          DMAMUX1_Channel9_BASE_S

#define DMAMUX1_Channel10              DMAMUX1_Channel10_S
#define DMAMUX1_Channel10_BASE         DMAMUX1_Channel10_BASE_S

#define DMAMUX1_Channel11              DMAMUX1_Channel11_S
#define DMAMUX1_Channel11_BASE         DMAMUX1_Channel11_BASE_S

#define DMAMUX1_Channel12              DMAMUX1_Channel12_S
#define DMAMUX1_Channel12_BASE         DMAMUX1_Channel12_BASE_S

#define DMAMUX1_Channel13              DMAMUX1_Channel13_S
#define DMAMUX1_Channel13_BASE         DMAMUX1_Channel13_BASE_S

#define DMAMUX1_Channel14              DMAMUX1_Channel14_S
#define DMAMUX1_Channel14_BASE         DMAMUX1_Channel14_BASE_S

#define DMAMUX1_Channel15              DMAMUX1_Channel15_S
#define DMAMUX1_Channel15_BASE         DMAMUX1_Channel15_BASE_S

#define DMAMUX1_RequestGenerator0      DMAMUX1_RequestGenerator0_S
#define DMAMUX1_RequestGenerator0_BASE DMAMUX1_RequestGenerator0_BASE_S

#define DMAMUX1_RequestGenerator1      DMAMUX1_RequestGenerator1_S
#define DMAMUX1_RequestGenerator1_BASE DMAMUX1_RequestGenerator1_BASE_S

#define DMAMUX1_RequestGenerator2      DMAMUX1_RequestGenerator2_S
#define DMAMUX1_RequestGenerator2_BASE DMAMUX1_RequestGenerator2_BASE_S

#define DMAMUX1_RequestGenerator3      DMAMUX1_RequestGenerator3_S
#define DMAMUX1_RequestGenerator3_BASE DMAMUX1_RequestGenerator3_BASE_S

#define DMAMUX1_ChannelStatus          DMAMUX1_ChannelStatus_S
#define DMAMUX1_ChannelStatus_BASE     DMAMUX1_ChannelStatus_BASE_S

#define DMAMUX1_RequestGenStatus       DMAMUX1_RequestGenStatus_S
#define DMAMUX1_RequestGenStatus_BASE  DMAMUX1_RequestGenStatus_BASE_S

