ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32L5xx/stm32l552xx.h
#define COMP1                          COMP1_S
#define COMP1_BASE                     COMP1_BASE_S

#define COMP2                          COMP2_S
#define COMP2_BASE                     COMP2_BASE_S

#define COMP12_COMMON                  COMP12_COMMON_S
#define COMP12_COMMON_BASE             COMP12_COMMON_BASE_S

#define SAI1                           SAI1_S
#define SAI1_BASE                      SAI1_BASE_S

#define SAI1_Block_A                   SAI1_Block_A_S
#define SAI1_Block_A_BASE              SAI1_Block_A_BASE_S

#define SAI1_Block_B                   SAI1_Block_B_S
#define SAI1_Block_B_BASE              SAI1_Block_B_BASE_S

#define SAI2                           SAI2_S
#define SAI2_BASE                      SAI2_BASE_S

#define SAI2_Block_A                   SAI2_Block_A_S
#define SAI2_Block_A_BASE              SAI2_Block_A_BASE_S

#define SAI2_Block_B                   SAI2_Block_B_S
#define SAI2_Block_B_BASE              SAI2_Block_B_BASE_S

#define DFSDM1_Channel0                DFSDM1_Channel0_S
#define DFSDM1_Channel0_BASE           DFSDM1_Channel0_BASE_S

#define DFSDM1_Channel1                DFSDM1_Channel1_S
#define DFSDM1_Channel1_BASE           DFSDM1_Channel1_BASE_S

#define DFSDM1_Channel2                DFSDM1_Channel2_S
#define DFSDM1_Channel2_BASE           DFSDM1_Channel2_BASE_S

#define DFSDM1_Channel3                DFSDM1_Channel3_S
#define DFSDM1_Channel3_BASE           DFSDM1_Channel3_BASE_S

#define DFSDM1_Filter0                 DFSDM1_Filter0_S
#define DFSDM1_Filter0_BASE            DFSDM1_Filter0_BASE_S

#define DFSDM1_Filter1                 DFSDM1_Filter1_S
#define DFSDM1_Filter1_BASE            DFSDM1_Filter1_BASE_S

#define DFSDM1_Filter2                 DFSDM1_Filter2_S
#define DFSDM1_Filter2_BASE            DFSDM1_Filter2_BASE_S

#define DFSDM1_Filter3                 DFSDM1_Filter3_S
#define DFSDM1_Filter3_BASE            DFSDM1_Filter3_BASE_S

#define CRC                            CRC_S
#define CRC_BASE                       CRC_BASE_S

#define TSC                            TSC_S
#define TSC_BASE                       TSC_BASE_S

#define ADC1                           ADC1_S
#define ADC1_BASE                      ADC1_BASE_S

#define ADC2                           ADC2_S
#define ADC2_BASE                      ADC2_BASE_S

#define ADC12_COMMON                   ADC12_COMMON_S
#define ADC12_COMMON_BASE              ADC12_COMMON_BASE_S

#define HASH                           HASH_S
#define HASH_BASE                      HASH_BASE_S

#define HASH_DIGEST                    HASH_DIGEST_S
#define HASH_DIGEST_BASE               HASH_DIGEST_BASE_S

#define RNG                            RNG_S
#define RNG_BASE                       RNG_BASE_S

#define SDMMC1                         SDMMC1_S
#define SDMMC1_BASE                    SDMMC1_BASE_S

#define FMC_R_BASE                     FMC_R_BASE_S

#define FMC_Bank1_R                    FMC_Bank1_R_S
#define FMC_Bank1_R_BASE               FMC_Bank1_R_BASE_S

#define FMC_Bank1E_R                   FMC_Bank1E_R_S
#define FMC_Bank1E_R_BASE              FMC_Bank1E_R_BASE_S

#define FMC_Bank3_R                    FMC_Bank3_R_S
#define FMC_Bank3_R_BASE               FMC_Bank3_R_BASE_S

#define OCTOSPI1                       OCTOSPI1_S
#define OCTOSPI1_R_BASE                OCTOSPI1_R_BASE_S

#else

/*!< Memory base addresses for Non secure peripherals */
#define FLASH_BASE                     FLASH_BASE_NS
#define SRAM1_BASE                     SRAM1_BASE_NS
#define SRAM2_BASE                     SRAM2_BASE_NS
#define SRAM_BASE                      SRAM1_BASE_NS
#define PERIPH_BASE                    PERIPH_BASE_NS
#define APB1PERIPH_BASE                APB1PERIPH_BASE_NS
#define APB2PERIPH_BASE                APB2PERIPH_BASE_NS
#define AHB1PERIPH_BASE                AHB1PERIPH_BASE_NS
#define AHB2PERIPH_BASE                AHB2PERIPH_BASE_NS
#define AHB3PERIPH_BASE                AHB3PERIPH_BASE_NS

/*!< Instance aliases and base addresses for Non secure peripherals */
#define RCC                            RCC_NS
#define RCC_BASE                       RCC_BASE_NS

#define FLASH                          FLASH_NS
#define FLASH_R_BASE                   FLASH_R_BASE_NS

#define DMA1                           DMA1_NS
#define DMA1_BASE                      DMA1_BASE_NS

#define DMA1_Channel1                  DMA1_Channel1_NS
#define DMA1_Channel1_BASE             DMA1_Channel1_BASE_NS

#define DMA1_Channel2                  DMA1_Channel2_NS
#define DMA1_Channel2_BASE             DMA1_Channel2_BASE_NS

#define DMA1_Channel3                  DMA1_Channel3_NS
#define DMA1_Channel3_BASE             DMA1_Channel3_BASE_NS

#define DMA1_Channel4                  DMA1_Channel4_NS
#define DMA1_Channel4_BASE             DMA1_Channel4_BASE_NS

#define DMA1_Channel5                  DMA1_Channel5_NS
#define DMA1_Channel5_BASE             DMA1_Channel5_BASE_NS

#define DMA1_Channel6                  DMA1_Channel6_NS
#define DMA1_Channel6_BASE             DMA1_Channel6_BASE_NS

#define DMA1_Channel7                  DMA1_Channel7_NS
#define DMA1_Channel7_BASE             DMA1_Channel7_BASE_NS

#define DMA1_Channel8                  DMA1_Channel8_NS
#define DMA1_Channel8_BASE             DMA1_Channel8_BASE_NS

#define DMA2                           DMA2_NS
#define DMA2_BASE                      DMA2_BASE_NS

#define DMA2_Channel1                  DMA2_Channel1_NS
#define DMA2_Channel1_BASE             DMA2_Channel1_BASE_NS

#define DMA2_Channel2                  DMA2_Channel2_NS
#define DMA2_Channel2_BASE             DMA2_Channel2_BASE_NS

#define DMA2_Channel3                  DMA2_Channel3_NS
#define DMA2_Channel3_BASE             DMA2_Channel3_BASE_NS

#define DMA2_Channel4                  DMA2_Channel4_NS
#define DMA2_Channel4_BASE             DMA2_Channel4_BASE_NS

#define DMA2_Channel5                  DMA2_Channel5_NS
#define DMA2_Channel5_BASE             DMA2_Channel5_BASE_NS

#define DMA2_Channel6                  DMA2_Channel6_NS
#define DMA2_Channel6_BASE             DMA2_Channel6_BASE_NS

#define DMA2_Channel7                  DMA2_Channel7_NS
#define DMA2_Channel7_BASE             DMA2_Channel7_BASE_NS

#define DMA2_Channel8                  DMA2_Channel8_NS
#define DMA2_Channel8_BASE             DMA2_Channel8_BASE_NS

#define DMAMUX1                        DMAMUX1_NS
#define DMAMUX1_BASE                   DMAMUX1_BASE_NS

