ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32L5xx/stm32l552xx.h
/********************  Bit definition for PWR_PUCRC register  ********************/
#define PWR_PUCRC_PU0_Pos            (0U)
#define PWR_PUCRC_PU0_Msk            (0x1UL << PWR_PUCRC_PU0_Pos)              /*!< 0x00000001 */
#define PWR_PUCRC_PU0                PWR_PUCRC_PU0_Msk                         /*!< Port PC0 Pull-Up set  */
#define PWR_PUCRC_PU1_Pos            (1U)
#define PWR_PUCRC_PU1_Msk            (0x1UL << PWR_PUCRC_PU1_Pos)              /*!< 0x00000002 */
#define PWR_PUCRC_PU1                PWR_PUCRC_PU1_Msk                         /*!< Port PC1 Pull-Up set  */
#define PWR_PUCRC_PU2_Pos            (2U)
#define PWR_PUCRC_PU2_Msk            (0x1UL << PWR_PUCRC_PU2_Pos)              /*!< 0x00000004 */
#define PWR_PUCRC_PU2                PWR_PUCRC_PU2_Msk                         /*!< Port PC2 Pull-Up set  */
#define PWR_PUCRC_PU3_Pos            (3U)
#define PWR_PUCRC_PU3_Msk            (0x1UL << PWR_PUCRC_PU3_Pos)              /*!< 0x00000008 */
#define PWR_PUCRC_PU3                PWR_PUCRC_PU3_Msk                         /*!< Port PC3 Pull-Up set  */
#define PWR_PUCRC_PU4_Pos            (4U)
#define PWR_PUCRC_PU4_Msk            (0x1UL << PWR_PUCRC_PU4_Pos)              /*!< 0x00000010 */
#define PWR_PUCRC_PU4                PWR_PUCRC_PU4_Msk                         /*!< Port PC4 Pull-Up set  */
#define PWR_PUCRC_PU5_Pos            (5U)
#define PWR_PUCRC_PU5_Msk            (0x1UL << PWR_PUCRC_PU5_Pos)              /*!< 0x00000020 */
#define PWR_PUCRC_PU5                PWR_PUCRC_PU5_Msk                         /*!< Port PC5 Pull-Up set  */
#define PWR_PUCRC_PU6_Pos            (6U)
#define PWR_PUCRC_PU6_Msk            (0x1UL << PWR_PUCRC_PU6_Pos)              /*!< 0x00000040 */
#define PWR_PUCRC_PU6                PWR_PUCRC_PU6_Msk                         /*!< Port PC6 Pull-Up set  */
#define PWR_PUCRC_PU7_Pos            (7U)
#define PWR_PUCRC_PU7_Msk            (0x1UL << PWR_PUCRC_PU7_Pos)              /*!< 0x00000080 */
#define PWR_PUCRC_PU7                PWR_PUCRC_PU7_Msk                         /*!< Port PC7 Pull-Up set  */
#define PWR_PUCRC_PU8_Pos            (8U)
#define PWR_PUCRC_PU8_Msk            (0x1UL << PWR_PUCRC_PU8_Pos)              /*!< 0x00000100 */
#define PWR_PUCRC_PU8                PWR_PUCRC_PU8_Msk                         /*!< Port PC8 Pull-Up set  */
#define PWR_PUCRC_PU9_Pos            (9U)
#define PWR_PUCRC_PU9_Msk            (0x1UL << PWR_PUCRC_PU9_Pos)              /*!< 0x00000200 */
#define PWR_PUCRC_PU9                PWR_PUCRC_PU9_Msk                         /*!< Port PC9 Pull-Up set  */
#define PWR_PUCRC_PU10_Pos           (10U)
#define PWR_PUCRC_PU10_Msk           (0x1UL << PWR_PUCRC_PU10_Pos)             /*!< 0x00000400 */
#define PWR_PUCRC_PU10               PWR_PUCRC_PU10_Msk                        /*!< Port PC10 Pull-Up set */
#define PWR_PUCRC_PU11_Pos           (11U)
#define PWR_PUCRC_PU11_Msk           (0x1UL << PWR_PUCRC_PU11_Pos)             /*!< 0x00000800 */
#define PWR_PUCRC_PU11               PWR_PUCRC_PU11_Msk                        /*!< Port PC11 Pull-Up set */
#define PWR_PUCRC_PU12_Pos           (12U)
#define PWR_PUCRC_PU12_Msk           (0x1UL << PWR_PUCRC_PU12_Pos)             /*!< 0x00001000 */
#define PWR_PUCRC_PU12               PWR_PUCRC_PU12_Msk                        /*!< Port PC12 Pull-Up set */
#define PWR_PUCRC_PU13_Pos           (13U)
#define PWR_PUCRC_PU13_Msk           (0x1UL << PWR_PUCRC_PU13_Pos)             /*!< 0x00002000 */
#define PWR_PUCRC_PU13               PWR_PUCRC_PU13_Msk                        /*!< Port PC13 Pull-Up set */
#define PWR_PUCRC_PU14_Pos           (14U)
#define PWR_PUCRC_PU14_Msk           (0x1UL << PWR_PUCRC_PU14_Pos)             /*!< 0x00004000 */
#define PWR_PUCRC_PU14               PWR_PUCRC_PU14_Msk                        /*!< Port PC14 Pull-Up set */
#define PWR_PUCRC_PU15_Pos           (15U)
#define PWR_PUCRC_PU15_Msk           (0x1UL << PWR_PUCRC_PU15_Pos)             /*!< 0x00008000 */
#define PWR_PUCRC_PU15               PWR_PUCRC_PU15_Msk                        /*!< Port PC15 Pull-Up set */

/********************  Bit definition for PWR_PDCRC register  ********************/
#define PWR_PDCRC_PD0_Pos            (0U)
#define PWR_PDCRC_PD0_Msk            (0x1UL << PWR_PDCRC_PD0_Pos)              /*!< 0x00000001 */
#define PWR_PDCRC_PD0                PWR_PDCRC_PD0_Msk                         /*!< Port PC0 Pull-Down set  */
#define PWR_PDCRC_PD1_Pos            (1U)
#define PWR_PDCRC_PD1_Msk            (0x1UL << PWR_PDCRC_PD1_Pos)              /*!< 0x00000002 */
#define PWR_PDCRC_PD1                PWR_PDCRC_PD1_Msk                         /*!< Port PC1 Pull-Down set  */
#define PWR_PDCRC_PD2_Pos            (2U)
#define PWR_PDCRC_PD2_Msk            (0x1UL << PWR_PDCRC_PD2_Pos)              /*!< 0x00000004 */
#define PWR_PDCRC_PD2                PWR_PDCRC_PD2_Msk                         /*!< Port PC2 Pull-Down set  */
#define PWR_PDCRC_PD3_Pos            (3U)
#define PWR_PDCRC_PD3_Msk            (0x1UL << PWR_PDCRC_PD3_Pos)              /*!< 0x00000008 */
#define PWR_PDCRC_PD3                PWR_PDCRC_PD3_Msk                         /*!< Port PC3 Pull-Down set  */
#define PWR_PDCRC_PD4_Pos            (4U)
#define PWR_PDCRC_PD4_Msk            (0x1UL << PWR_PDCRC_PD4_Pos)              /*!< 0x00000010 */
#define PWR_PDCRC_PD4                PWR_PDCRC_PD4_Msk                         /*!< Port PC4 Pull-Down set  */
#define PWR_PDCRC_PD5_Pos            (5U)
#define PWR_PDCRC_PD5_Msk            (0x1UL << PWR_PDCRC_PD5_Pos)              /*!< 0x00000020 */
#define PWR_PDCRC_PD5                PWR_PDCRC_PD5_Msk                         /*!< Port PC5 Pull-Down set  */
#define PWR_PDCRC_PD6_Pos            (6U)
#define PWR_PDCRC_PD6_Msk            (0x1UL << PWR_PDCRC_PD6_Pos)              /*!< 0x00000040 */
#define PWR_PDCRC_PD6                PWR_PDCRC_PD6_Msk                         /*!< Port PC6 Pull-Down set  */
#define PWR_PDCRC_PD7_Pos            (7U)
#define PWR_PDCRC_PD7_Msk            (0x1UL << PWR_PDCRC_PD7_Pos)              /*!< 0x00000080 */
#define PWR_PDCRC_PD7                PWR_PDCRC_PD7_Msk                         /*!< Port PC7 Pull-Down set  */
#define PWR_PDCRC_PD8_Pos            (8U)
#define PWR_PDCRC_PD8_Msk            (0x1UL << PWR_PDCRC_PD8_Pos)              /*!< 0x00000100 */
#define PWR_PDCRC_PD8                PWR_PDCRC_PD8_Msk                         /*!< Port PC8 Pull-Down set  */
#define PWR_PDCRC_PD9_Pos            (9U)
#define PWR_PDCRC_PD9_Msk            (0x1UL << PWR_PDCRC_PD9_Pos)              /*!< 0x00000200 */
#define PWR_PDCRC_PD9                PWR_PDCRC_PD9_Msk                         /*!< Port PC9 Pull-Down set  */
#define PWR_PDCRC_PD10_Pos           (10U)
#define PWR_PDCRC_PD10_Msk           (0x1UL << PWR_PDCRC_PD10_Pos)             /*!< 0x00000400 */
#define PWR_PDCRC_PD10               PWR_PDCRC_PD10_Msk                        /*!< Port PC10 Pull-Down set */
#define PWR_PDCRC_PD11_Pos           (11U)
#define PWR_PDCRC_PD11_Msk           (0x1UL << PWR_PDCRC_PD11_Pos)             /*!< 0x00000800 */
#define PWR_PDCRC_PD11               PWR_PDCRC_PD11_Msk                        /*!< Port PC11 Pull-Down set */
#define PWR_PDCRC_PD12_Pos           (12U)
#define PWR_PDCRC_PD12_Msk           (0x1UL << PWR_PDCRC_PD12_Pos)             /*!< 0x00001000 */
#define PWR_PDCRC_PD12               PWR_PDCRC_PD12_Msk                        /*!< Port PC12 Pull-Down set */
#define PWR_PDCRC_PD13_Pos           (13U)
#define PWR_PDCRC_PD13_Msk           (0x1UL << PWR_PDCRC_PD13_Pos)             /*!< 0x00002000 */
#define PWR_PDCRC_PD13               PWR_PDCRC_PD13_Msk                        /*!< Port PC13 Pull-Down set */
#define PWR_PDCRC_PD14_Pos           (14U)
#define PWR_PDCRC_PD14_Msk           (0x1UL << PWR_PDCRC_PD14_Pos)             /*!< 0x00004000 */
#define PWR_PDCRC_PD14               PWR_PDCRC_PD14_Msk                        /*!< Port PC14 Pull-Down set */
#define PWR_PDCRC_PD15_Pos           (15U)
#define PWR_PDCRC_PD15_Msk           (0x1UL << PWR_PDCRC_PD15_Pos)             /*!< 0x00008000 */
#define PWR_PDCRC_PD15               PWR_PDCRC_PD15_Msk                        /*!< Port PC15 Pull-Down set */

/********************  Bit definition for PWR_PUCRD register  ********************/
#define PWR_PUCRD_PU0_Pos            (0U)
#define PWR_PUCRD_PU0_Msk            (0x1UL << PWR_PUCRD_PU0_Pos)              /*!< 0x00000001 */
#define PWR_PUCRD_PU0                PWR_PUCRD_PU0_Msk                         /*!< Port PD0 Pull-Up set  */
#define PWR_PUCRD_PU1_Pos            (1U)
#define PWR_PUCRD_PU1_Msk            (0x1UL << PWR_PUCRD_PU1_Pos)              /*!< 0x00000002 */
#define PWR_PUCRD_PU1                PWR_PUCRD_PU1_Msk                         /*!< Port PD1 Pull-Up set  */
#define PWR_PUCRD_PU2_Pos            (2U)
#define PWR_PUCRD_PU2_Msk            (0x1UL << PWR_PUCRD_PU2_Pos)              /*!< 0x00000004 */
#define PWR_PUCRD_PU2                PWR_PUCRD_PU2_Msk                         /*!< Port PD2 Pull-Up set  */
#define PWR_PUCRD_PU3_Pos            (3U)
#define PWR_PUCRD_PU3_Msk            (0x1UL << PWR_PUCRD_PU3_Pos)              /*!< 0x00000008 */
#define PWR_PUCRD_PU3                PWR_PUCRD_PU3_Msk                         /*!< Port PD3 Pull-Up set  */
#define PWR_PUCRD_PU4_Pos            (4U)
#define PWR_PUCRD_PU4_Msk            (0x1UL << PWR_PUCRD_PU4_Pos)              /*!< 0x00000010 */
#define PWR_PUCRD_PU4                PWR_PUCRD_PU4_Msk                         /*!< Port PD4 Pull-Up set  */
#define PWR_PUCRD_PU5_Pos            (5U)
#define PWR_PUCRD_PU5_Msk            (0x1UL << PWR_PUCRD_PU5_Pos)              /*!< 0x00000020 */
#define PWR_PUCRD_PU5                PWR_PUCRD_PU5_Msk                         /*!< Port PD5 Pull-Up set  */
#define PWR_PUCRD_PU6_Pos            (6U)
#define PWR_PUCRD_PU6_Msk            (0x1UL << PWR_PUCRD_PU6_Pos)              /*!< 0x00000040 */
#define PWR_PUCRD_PU6                PWR_PUCRD_PU6_Msk                         /*!< Port PD6 Pull-Up set  */
#define PWR_PUCRD_PU7_Pos            (7U)
#define PWR_PUCRD_PU7_Msk            (0x1UL << PWR_PUCRD_PU7_Pos)              /*!< 0x00000080 */
#define PWR_PUCRD_PU7                PWR_PUCRD_PU7_Msk                         /*!< Port PD7 Pull-Up set  */
#define PWR_PUCRD_PU8_Pos            (8U)
#define PWR_PUCRD_PU8_Msk            (0x1UL << PWR_PUCRD_PU8_Pos)              /*!< 0x00000100 */
#define PWR_PUCRD_PU8                PWR_PUCRD_PU8_Msk                         /*!< Port PD8 Pull-Up set  */
#define PWR_PUCRD_PU9_Pos            (9U)
#define PWR_PUCRD_PU9_Msk            (0x1UL << PWR_PUCRD_PU9_Pos)              /*!< 0x00000200 */
#define PWR_PUCRD_PU9                PWR_PUCRD_PU9_Msk                         /*!< Port PD9 Pull-Up set  */
#define PWR_PUCRD_PU10_Pos           (10U)
#define PWR_PUCRD_PU10_Msk           (0x1UL << PWR_PUCRD_PU10_Pos)             /*!< 0x00000400 */
#define PWR_PUCRD_PU10               PWR_PUCRD_PU10_Msk                        /*!< Port PD10 Pull-Up set */
#define PWR_PUCRD_PU11_Pos           (11U)
#define PWR_PUCRD_PU11_Msk           (0x1UL << PWR_PUCRD_PU11_Pos)             /*!< 0x00000800 */
#define PWR_PUCRD_PU11               PWR_PUCRD_PU11_Msk                        /*!< Port PD11 Pull-Up set */
#define PWR_PUCRD_PU12_Pos           (12U)
#define PWR_PUCRD_PU12_Msk           (0x1UL << PWR_PUCRD_PU12_Pos)             /*!< 0x00001000 */
#define PWR_PUCRD_PU12               PWR_PUCRD_PU12_Msk                        /*!< Port PD12 Pull-Up set */
#define PWR_PUCRD_PU13_Pos           (13U)
#define PWR_PUCRD_PU13_Msk           (0x1UL << PWR_PUCRD_PU13_Pos)             /*!< 0x00002000 */
#define PWR_PUCRD_PU13               PWR_PUCRD_PU13_Msk                        /*!< Port PD13 Pull-Up set */
#define PWR_PUCRD_PU14_Pos           (14U)
#define PWR_PUCRD_PU14_Msk           (0x1UL << PWR_PUCRD_PU14_Pos)             /*!< 0x00004000 */
#define PWR_PUCRD_PU14               PWR_PUCRD_PU14_Msk                        /*!< Port PD14 Pull-Up set */
#define PWR_PUCRD_PU15_Pos           (15U)
#define PWR_PUCRD_PU15_Msk           (0x1UL << PWR_PUCRD_PU15_Pos)             /*!< 0x00008000 */
#define PWR_PUCRD_PU15               PWR_PUCRD_PU15_Msk                        /*!< Port PD15 Pull-Up set */

