ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32L5xx/stm32l552xx.h
/********************  Bit definition for PWR_PDCRD register  ********************/
#define PWR_PDCRD_PD0_Pos            (0U)
#define PWR_PDCRD_PD0_Msk            (0x1UL << PWR_PDCRD_PD0_Pos)              /*!< 0x00000001 */
#define PWR_PDCRD_PD0                PWR_PDCRD_PD0_Msk                         /*!< Port PD0 Pull-Down set  */
#define PWR_PDCRD_PD1_Pos            (1U)
#define PWR_PDCRD_PD1_Msk            (0x1UL << PWR_PDCRD_PD1_Pos)              /*!< 0x00000002 */
#define PWR_PDCRD_PD1                PWR_PDCRD_PD1_Msk                         /*!< Port PD1 Pull-Down set  */
#define PWR_PDCRD_PD2_Pos            (2U)
#define PWR_PDCRD_PD2_Msk            (0x1UL << PWR_PDCRD_PD2_Pos)              /*!< 0x00000004 */
#define PWR_PDCRD_PD2                PWR_PDCRD_PD2_Msk                         /*!< Port PD2 Pull-Down set  */
#define PWR_PDCRD_PD3_Pos            (3U)
#define PWR_PDCRD_PD3_Msk            (0x1UL << PWR_PDCRD_PD3_Pos)              /*!< 0x00000008 */
#define PWR_PDCRD_PD3                PWR_PDCRD_PD3_Msk                         /*!< Port PD3 Pull-Down set  */
#define PWR_PDCRD_PD4_Pos            (4U)
#define PWR_PDCRD_PD4_Msk            (0x1UL << PWR_PDCRD_PD4_Pos)              /*!< 0x00000010 */
#define PWR_PDCRD_PD4                PWR_PDCRD_PD4_Msk                         /*!< Port PD4 Pull-Down set  */
#define PWR_PDCRD_PD5_Pos            (5U)
#define PWR_PDCRD_PD5_Msk            (0x1UL << PWR_PDCRD_PD5_Pos)              /*!< 0x00000020 */
#define PWR_PDCRD_PD5                PWR_PDCRD_PD5_Msk                         /*!< Port PD5 Pull-Down set  */
#define PWR_PDCRD_PD6_Pos            (6U)
#define PWR_PDCRD_PD6_Msk            (0x1UL << PWR_PDCRD_PD6_Pos)              /*!< 0x00000040 */
#define PWR_PDCRD_PD6                PWR_PDCRD_PD6_Msk                         /*!< Port PD6 Pull-Down set  */
#define PWR_PDCRD_PD7_Pos            (7U)
#define PWR_PDCRD_PD7_Msk            (0x1UL << PWR_PDCRD_PD7_Pos)              /*!< 0x00000080 */
#define PWR_PDCRD_PD7                PWR_PDCRD_PD7_Msk                         /*!< Port PD7 Pull-Down set  */
#define PWR_PDCRD_PD8_Pos            (8U)
#define PWR_PDCRD_PD8_Msk            (0x1UL << PWR_PDCRD_PD8_Pos)              /*!< 0x00000100 */
#define PWR_PDCRD_PD8                PWR_PDCRD_PD8_Msk                         /*!< Port PD8 Pull-Down set  */
#define PWR_PDCRD_PD9_Pos            (9U)
#define PWR_PDCRD_PD9_Msk            (0x1UL << PWR_PDCRD_PD9_Pos)              /*!< 0x00000200 */
#define PWR_PDCRD_PD9                PWR_PDCRD_PD9_Msk                         /*!< Port PD9 Pull-Down set  */
#define PWR_PDCRD_PD10_Pos           (10U)
#define PWR_PDCRD_PD10_Msk           (0x1UL << PWR_PDCRD_PD10_Pos)             /*!< 0x00000400 */
#define PWR_PDCRD_PD10               PWR_PDCRD_PD10_Msk                        /*!< Port PD10 Pull-Down set */
#define PWR_PDCRD_PD11_Pos           (11U)
#define PWR_PDCRD_PD11_Msk           (0x1UL << PWR_PDCRD_PD11_Pos)             /*!< 0x00000800 */
#define PWR_PDCRD_PD11               PWR_PDCRD_PD11_Msk                        /*!< Port PD11 Pull-Down set */
#define PWR_PDCRD_PD12_Pos           (12U)
#define PWR_PDCRD_PD12_Msk           (0x1UL << PWR_PDCRD_PD12_Pos)             /*!< 0x00001000 */
#define PWR_PDCRD_PD12               PWR_PDCRD_PD12_Msk                        /*!< Port PD12 Pull-Down set */
#define PWR_PDCRD_PD13_Pos           (13U)
#define PWR_PDCRD_PD13_Msk           (0x1UL << PWR_PDCRD_PD13_Pos)             /*!< 0x00002000 */
#define PWR_PDCRD_PD13               PWR_PDCRD_PD13_Msk                        /*!< Port PD13 Pull-Down set */
#define PWR_PDCRD_PD14_Pos           (14U)
#define PWR_PDCRD_PD14_Msk           (0x1UL << PWR_PDCRD_PD14_Pos)             /*!< 0x00004000 */
#define PWR_PDCRD_PD14               PWR_PDCRD_PD14_Msk                        /*!< Port PD14 Pull-Down set */
#define PWR_PDCRD_PD15_Pos           (15U)
#define PWR_PDCRD_PD15_Msk           (0x1UL << PWR_PDCRD_PD15_Pos)             /*!< 0x00008000 */
#define PWR_PDCRD_PD15               PWR_PDCRD_PD15_Msk                        /*!< Port PD15 Pull-Down set */

/********************  Bit definition for PWR_PUCRE register  ********************/
#define PWR_PUCRE_PU0_Pos            (0U)
#define PWR_PUCRE_PU0_Msk            (0x1UL << PWR_PUCRE_PU0_Pos)              /*!< 0x00000001 */
#define PWR_PUCRE_PU0                PWR_PUCRE_PU0_Msk                         /*!< Port PE0 Pull-Up set  */
#define PWR_PUCRE_PU1_Pos            (1U)
#define PWR_PUCRE_PU1_Msk            (0x1UL << PWR_PUCRE_PU1_Pos)              /*!< 0x00000002 */
#define PWR_PUCRE_PU1                PWR_PUCRE_PU1_Msk                         /*!< Port PE1 Pull-Up set  */
#define PWR_PUCRE_PU2_Pos            (2U)
#define PWR_PUCRE_PU2_Msk            (0x1UL << PWR_PUCRE_PU2_Pos)              /*!< 0x00000004 */
#define PWR_PUCRE_PU2                PWR_PUCRE_PU2_Msk                         /*!< Port PE2 Pull-Up set  */
#define PWR_PUCRE_PU3_Pos            (3U)
#define PWR_PUCRE_PU3_Msk            (0x1UL << PWR_PUCRE_PU3_Pos)              /*!< 0x00000008 */
#define PWR_PUCRE_PU3                PWR_PUCRE_PU3_Msk                         /*!< Port PE3 Pull-Up set  */
#define PWR_PUCRE_PU4_Pos            (4U)
#define PWR_PUCRE_PU4_Msk            (0x1UL << PWR_PUCRE_PU4_Pos)              /*!< 0x00000010 */
#define PWR_PUCRE_PU4                PWR_PUCRE_PU4_Msk                         /*!< Port PE4 Pull-Up set  */
#define PWR_PUCRE_PU5_Pos            (5U)
#define PWR_PUCRE_PU5_Msk            (0x1UL << PWR_PUCRE_PU5_Pos)              /*!< 0x00000020 */
#define PWR_PUCRE_PU5                PWR_PUCRE_PU5_Msk                         /*!< Port PE5 Pull-Up set  */
#define PWR_PUCRE_PU6_Pos            (6U)
#define PWR_PUCRE_PU6_Msk            (0x1UL << PWR_PUCRE_PU6_Pos)              /*!< 0x00000040 */
#define PWR_PUCRE_PU6                PWR_PUCRE_PU6_Msk                         /*!< Port PE6 Pull-Up set  */
#define PWR_PUCRE_PU7_Pos            (7U)
#define PWR_PUCRE_PU7_Msk            (0x1UL << PWR_PUCRE_PU7_Pos)              /*!< 0x00000080 */
#define PWR_PUCRE_PU7                PWR_PUCRE_PU7_Msk                         /*!< Port PE7 Pull-Up set  */
#define PWR_PUCRE_PU8_Pos            (8U)
#define PWR_PUCRE_PU8_Msk            (0x1UL << PWR_PUCRE_PU8_Pos)              /*!< 0x00000100 */
#define PWR_PUCRE_PU8                PWR_PUCRE_PU8_Msk                         /*!< Port PE8 Pull-Up set  */
#define PWR_PUCRE_PU9_Pos            (9U)
#define PWR_PUCRE_PU9_Msk            (0x1UL << PWR_PUCRE_PU9_Pos)              /*!< 0x00000200 */
#define PWR_PUCRE_PU9                PWR_PUCRE_PU9_Msk                         /*!< Port PE9 Pull-Up set  */
#define PWR_PUCRE_PU10_Pos           (10U)
#define PWR_PUCRE_PU10_Msk           (0x1UL << PWR_PUCRE_PU10_Pos)             /*!< 0x00000400 */
#define PWR_PUCRE_PU10               PWR_PUCRE_PU10_Msk                        /*!< Port PE10 Pull-Up set */
#define PWR_PUCRE_PU11_Pos           (11U)
#define PWR_PUCRE_PU11_Msk           (0x1UL << PWR_PUCRE_PU11_Pos)             /*!< 0x00000800 */
#define PWR_PUCRE_PU11               PWR_PUCRE_PU11_Msk                        /*!< Port PE11 Pull-Up set */
#define PWR_PUCRE_PU12_Pos           (12U)
#define PWR_PUCRE_PU12_Msk           (0x1UL << PWR_PUCRE_PU12_Pos)             /*!< 0x00001000 */
#define PWR_PUCRE_PU12               PWR_PUCRE_PU12_Msk                        /*!< Port PE12 Pull-Up set */
#define PWR_PUCRE_PU13_Pos           (13U)
#define PWR_PUCRE_PU13_Msk           (0x1UL << PWR_PUCRE_PU13_Pos)             /*!< 0x00002000 */
#define PWR_PUCRE_PU13               PWR_PUCRE_PU13_Msk                        /*!< Port PE13 Pull-Up set */
#define PWR_PUCRE_PU14_Pos           (14U)
#define PWR_PUCRE_PU14_Msk           (0x1UL << PWR_PUCRE_PU14_Pos)             /*!< 0x00004000 */
#define PWR_PUCRE_PU14               PWR_PUCRE_PU14_Msk                        /*!< Port PE14 Pull-Up set */
#define PWR_PUCRE_PU15_Pos           (15U)
#define PWR_PUCRE_PU15_Msk           (0x1UL << PWR_PUCRE_PU15_Pos)             /*!< 0x00008000 */
#define PWR_PUCRE_PU15               PWR_PUCRE_PU15_Msk                        /*!< Port PE15 Pull-Up set */

/********************  Bit definition for PWR_PDCRE register  ********************/
#define PWR_PDCRE_PD0_Pos            (0U)
#define PWR_PDCRE_PD0_Msk            (0x1UL << PWR_PDCRE_PD0_Pos)              /*!< 0x00000001 */
#define PWR_PDCRE_PD0                PWR_PDCRE_PD0_Msk                         /*!< Port PE0 Pull-Down set  */
#define PWR_PDCRE_PD1_Pos            (1U)
#define PWR_PDCRE_PD1_Msk            (0x1UL << PWR_PDCRE_PD1_Pos)              /*!< 0x00000002 */
#define PWR_PDCRE_PD1                PWR_PDCRE_PD1_Msk                         /*!< Port PE1 Pull-Down set  */
#define PWR_PDCRE_PD2_Pos            (2U)
#define PWR_PDCRE_PD2_Msk            (0x1UL << PWR_PDCRE_PD2_Pos)              /*!< 0x00000004 */
#define PWR_PDCRE_PD2                PWR_PDCRE_PD2_Msk                         /*!< Port PE2 Pull-Down set  */
#define PWR_PDCRE_PD3_Pos            (3U)
#define PWR_PDCRE_PD3_Msk            (0x1UL << PWR_PDCRE_PD3_Pos)              /*!< 0x00000008 */
#define PWR_PDCRE_PD3                PWR_PDCRE_PD3_Msk                         /*!< Port PE3 Pull-Down set  */
#define PWR_PDCRE_PD4_Pos            (4U)
#define PWR_PDCRE_PD4_Msk            (0x1UL << PWR_PDCRE_PD4_Pos)              /*!< 0x00000010 */
#define PWR_PDCRE_PD4                PWR_PDCRE_PD4_Msk                         /*!< Port PE4 Pull-Down set  */
#define PWR_PDCRE_PD5_Pos            (5U)
#define PWR_PDCRE_PD5_Msk            (0x1UL << PWR_PDCRE_PD5_Pos)              /*!< 0x00000020 */
#define PWR_PDCRE_PD5                PWR_PDCRE_PD5_Msk                         /*!< Port PE5 Pull-Down set  */
#define PWR_PDCRE_PD6_Pos            (6U)
#define PWR_PDCRE_PD6_Msk            (0x1UL << PWR_PDCRE_PD6_Pos)              /*!< 0x00000040 */
#define PWR_PDCRE_PD6                PWR_PDCRE_PD6_Msk                         /*!< Port PE6 Pull-Down set  */
#define PWR_PDCRE_PD7_Pos            (7U)
#define PWR_PDCRE_PD7_Msk            (0x1UL << PWR_PDCRE_PD7_Pos)              /*!< 0x00000080 */
#define PWR_PDCRE_PD7                PWR_PDCRE_PD7_Msk                         /*!< Port PE7 Pull-Down set  */
#define PWR_PDCRE_PD8_Pos            (8U)
#define PWR_PDCRE_PD8_Msk            (0x1UL << PWR_PDCRE_PD8_Pos)              /*!< 0x00000100 */
#define PWR_PDCRE_PD8                PWR_PDCRE_PD8_Msk                         /*!< Port PE8 Pull-Down set  */
#define PWR_PDCRE_PD9_Pos            (9U)
#define PWR_PDCRE_PD9_Msk            (0x1UL << PWR_PDCRE_PD9_Pos)              /*!< 0x00000200 */
#define PWR_PDCRE_PD9                PWR_PDCRE_PD9_Msk                         /*!< Port PE9 Pull-Down set  */
#define PWR_PDCRE_PD10_Pos           (10U)
#define PWR_PDCRE_PD10_Msk           (0x1UL << PWR_PDCRE_PD10_Pos)             /*!< 0x00000400 */
#define PWR_PDCRE_PD10               PWR_PDCRE_PD10_Msk                        /*!< Port PE10 Pull-Down set */
#define PWR_PDCRE_PD11_Pos           (11U)
#define PWR_PDCRE_PD11_Msk           (0x1UL << PWR_PDCRE_PD11_Pos)             /*!< 0x00000800 */
#define PWR_PDCRE_PD11               PWR_PDCRE_PD11_Msk                        /*!< Port PE11 Pull-Down set */
#define PWR_PDCRE_PD12_Pos           (12U)
#define PWR_PDCRE_PD12_Msk           (0x1UL << PWR_PDCRE_PD12_Pos)             /*!< 0x00001000 */
#define PWR_PDCRE_PD12               PWR_PDCRE_PD12_Msk                        /*!< Port PE12 Pull-Down set */
#define PWR_PDCRE_PD13_Pos           (13U)
#define PWR_PDCRE_PD13_Msk           (0x1UL << PWR_PDCRE_PD13_Pos)             /*!< 0x00002000 */
#define PWR_PDCRE_PD13               PWR_PDCRE_PD13_Msk                        /*!< Port PE13 Pull-Down set */
#define PWR_PDCRE_PD14_Pos           (14U)
#define PWR_PDCRE_PD14_Msk           (0x1UL << PWR_PDCRE_PD14_Pos)             /*!< 0x00004000 */
#define PWR_PDCRE_PD14               PWR_PDCRE_PD14_Msk                        /*!< Port PE14 Pull-Down set */
#define PWR_PDCRE_PD15_Pos           (15U)
#define PWR_PDCRE_PD15_Msk           (0x1UL << PWR_PDCRE_PD15_Pos)             /*!< 0x00008000 */
#define PWR_PDCRE_PD15               PWR_PDCRE_PD15_Msk                        /*!< Port PE15 Pull-Down set */

/********************  Bit definition for PWR_PUCRF register  ********************/
#define PWR_PUCRF_PU0_Pos            (0U)
#define PWR_PUCRF_PU0_Msk            (0x1UL << PWR_PUCRF_PU0_Pos)              /*!< 0x00000001 */
#define PWR_PUCRF_PU0                PWR_PUCRF_PU0_Msk                         /*!< Port PF0 Pull-Up set  */
#define PWR_PUCRF_PU1_Pos            (1U)
#define PWR_PUCRF_PU1_Msk            (0x1UL << PWR_PUCRF_PU1_Pos)              /*!< 0x00000002 */
#define PWR_PUCRF_PU1                PWR_PUCRF_PU1_Msk                         /*!< Port PF1 Pull-Up set  */
#define PWR_PUCRF_PU2_Pos            (2U)
#define PWR_PUCRF_PU2_Msk            (0x1UL << PWR_PUCRF_PU2_Pos)              /*!< 0x00000004 */
#define PWR_PUCRF_PU2                PWR_PUCRF_PU2_Msk                         /*!< Port PF2 Pull-Up set  */
#define PWR_PUCRF_PU3_Pos            (3U)
#define PWR_PUCRF_PU3_Msk            (0x1UL << PWR_PUCRF_PU3_Pos)              /*!< 0x00000008 */
#define PWR_PUCRF_PU3                PWR_PUCRF_PU3_Msk                         /*!< Port PF3 Pull-Up set  */
#define PWR_PUCRF_PU4_Pos            (4U)
#define PWR_PUCRF_PU4_Msk            (0x1UL << PWR_PUCRF_PU4_Pos)              /*!< 0x00000010 */
#define PWR_PUCRF_PU4                PWR_PUCRF_PU4_Msk                         /*!< Port PF4 Pull-Up set  */
#define PWR_PUCRF_PU5_Pos            (5U)
#define PWR_PUCRF_PU5_Msk            (0x1UL << PWR_PUCRF_PU5_Pos)              /*!< 0x00000020 */
#define PWR_PUCRF_PU5                PWR_PUCRF_PU5_Msk                         /*!< Port PF5 Pull-Up set  */
#define PWR_PUCRF_PU6_Pos            (6U)
#define PWR_PUCRF_PU6_Msk            (0x1UL << PWR_PUCRF_PU6_Pos)              /*!< 0x00000040 */
#define PWR_PUCRF_PU6                PWR_PUCRF_PU6_Msk                         /*!< Port PF6 Pull-Up set  */
#define PWR_PUCRF_PU7_Pos            (7U)
#define PWR_PUCRF_PU7_Msk            (0x1UL << PWR_PUCRF_PU7_Pos)              /*!< 0x00000080 */
#define PWR_PUCRF_PU7                PWR_PUCRF_PU7_Msk                         /*!< Port PF7 Pull-Up set  */
#define PWR_PUCRF_PU8_Pos            (8U)
#define PWR_PUCRF_PU8_Msk            (0x1UL << PWR_PUCRF_PU8_Pos)              /*!< 0x00000100 */
#define PWR_PUCRF_PU8                PWR_PUCRF_PU8_Msk                         /*!< Port PF8 Pull-Up set  */
#define PWR_PUCRF_PU9_Pos            (9U)
#define PWR_PUCRF_PU9_Msk            (0x1UL << PWR_PUCRF_PU9_Pos)              /*!< 0x00000200 */
#define PWR_PUCRF_PU9                PWR_PUCRF_PU9_Msk                         /*!< Port PF9 Pull-Up set  */
#define PWR_PUCRF_PU10_Pos           (10U)
#define PWR_PUCRF_PU10_Msk           (0x1UL << PWR_PUCRF_PU10_Pos)             /*!< 0x00000400 */
#define PWR_PUCRF_PU10               PWR_PUCRF_PU10_Msk                        /*!< Port PF10 Pull-Up set */
#define PWR_PUCRF_PU11_Pos           (11U)
#define PWR_PUCRF_PU11_Msk           (0x1UL << PWR_PUCRF_PU11_Pos)             /*!< 0x00000800 */
#define PWR_PUCRF_PU11               PWR_PUCRF_PU11_Msk                        /*!< Port PF11 Pull-Up set */
#define PWR_PUCRF_PU12_Pos           (12U)
#define PWR_PUCRF_PU12_Msk           (0x1UL << PWR_PUCRF_PU12_Pos)             /*!< 0x00001000 */
#define PWR_PUCRF_PU12               PWR_PUCRF_PU12_Msk                        /*!< Port PF12 Pull-Up set */
#define PWR_PUCRF_PU13_Pos           (13U)
#define PWR_PUCRF_PU13_Msk           (0x1UL << PWR_PUCRF_PU13_Pos)             /*!< 0x00002000 */
#define PWR_PUCRF_PU13               PWR_PUCRF_PU13_Msk                        /*!< Port PF13 Pull-Up set */
#define PWR_PUCRF_PU14_Pos           (14U)
#define PWR_PUCRF_PU14_Msk           (0x1UL << PWR_PUCRF_PU14_Pos)             /*!< 0x00004000 */
#define PWR_PUCRF_PU14               PWR_PUCRF_PU14_Msk                        /*!< Port PF14 Pull-Up set */
#define PWR_PUCRF_PU15_Pos           (15U)
#define PWR_PUCRF_PU15_Msk           (0x1UL << PWR_PUCRF_PU15_Pos)             /*!< 0x00008000 */
#define PWR_PUCRF_PU15               PWR_PUCRF_PU15_Msk                        /*!< Port PF15 Pull-Up set */

/********************  Bit definition for PWR_PDCRF register  ********************/
#define PWR_PDCRF_PD0_Pos            (0U)
#define PWR_PDCRF_PD0_Msk            (0x1UL << PWR_PDCRF_PD0_Pos)              /*!< 0x00000001 */
#define PWR_PDCRF_PD0                PWR_PDCRF_PD0_Msk                         /*!< Port PF0 Pull-Down set  */
#define PWR_PDCRF_PD1_Pos            (1U)
#define PWR_PDCRF_PD1_Msk            (0x1UL << PWR_PDCRF_PD1_Pos)              /*!< 0x00000002 */
#define PWR_PDCRF_PD1                PWR_PDCRF_PD1_Msk                         /*!< Port PF1 Pull-Down set  */
#define PWR_PDCRF_PD2_Pos            (2U)
#define PWR_PDCRF_PD2_Msk            (0x1UL << PWR_PDCRF_PD2_Pos)              /*!< 0x00000004 */
#define PWR_PDCRF_PD2                PWR_PDCRF_PD2_Msk                         /*!< Port PF2 Pull-Down set  */
#define PWR_PDCRF_PD3_Pos            (3U)
#define PWR_PDCRF_PD3_Msk            (0x1UL << PWR_PDCRF_PD3_Pos)              /*!< 0x00000008 */
#define PWR_PDCRF_PD3                PWR_PDCRF_PD3_Msk                         /*!< Port PF3 Pull-Down set  */
#define PWR_PDCRF_PD4_Pos            (4U)
#define PWR_PDCRF_PD4_Msk            (0x1UL << PWR_PDCRF_PD4_Pos)              /*!< 0x00000010 */
#define PWR_PDCRF_PD4                PWR_PDCRF_PD4_Msk                         /*!< Port PF4 Pull-Down set  */
#define PWR_PDCRF_PD5_Pos            (5U)
#define PWR_PDCRF_PD5_Msk            (0x1UL << PWR_PDCRF_PD5_Pos)              /*!< 0x00000020 */
#define PWR_PDCRF_PD5                PWR_PDCRF_PD5_Msk                         /*!< Port PF5 Pull-Down set  */
#define PWR_PDCRF_PD6_Pos            (6U)
#define PWR_PDCRF_PD6_Msk            (0x1UL << PWR_PDCRF_PD6_Pos)              /*!< 0x00000040 */
#define PWR_PDCRF_PD6                PWR_PDCRF_PD6_Msk                         /*!< Port PF6 Pull-Down set  */
#define PWR_PDCRF_PD7_Pos            (7U)
#define PWR_PDCRF_PD7_Msk            (0x1UL << PWR_PDCRF_PD7_Pos)              /*!< 0x00000080 */
#define PWR_PDCRF_PD7                PWR_PDCRF_PD7_Msk                         /*!< Port PF7 Pull-Down set  */
#define PWR_PDCRF_PD8_Pos            (8U)
#define PWR_PDCRF_PD8_Msk            (0x1UL << PWR_PDCRF_PD8_Pos)              /*!< 0x00000100 */
#define PWR_PDCRF_PD8                PWR_PDCRF_PD8_Msk                         /*!< Port PF8 Pull-Down set  */
#define PWR_PDCRF_PD9_Pos            (9U)
#define PWR_PDCRF_PD9_Msk            (0x1UL << PWR_PDCRF_PD9_Pos)              /*!< 0x00000200 */
#define PWR_PDCRF_PD9                PWR_PDCRF_PD9_Msk                         /*!< Port PF9 Pull-Down set  */
#define PWR_PDCRF_PD10_Pos           (10U)
#define PWR_PDCRF_PD10_Msk           (0x1UL << PWR_PDCRF_PD10_Pos)             /*!< 0x00000400 */
#define PWR_PDCRF_PD10               PWR_PDCRF_PD10_Msk                        /*!< Port PF10 Pull-Down set */
#define PWR_PDCRF_PD11_Pos           (11U)
#define PWR_PDCRF_PD11_Msk           (0x1UL << PWR_PDCRF_PD11_Pos)             /*!< 0x00000800 */
#define PWR_PDCRF_PD11               PWR_PDCRF_PD11_Msk                        /*!< Port PF11 Pull-Down set */
#define PWR_PDCRF_PD12_Pos           (12U)
#define PWR_PDCRF_PD12_Msk           (0x1UL << PWR_PDCRF_PD12_Pos)             /*!< 0x00001000 */
#define PWR_PDCRF_PD12               PWR_PDCRF_PD12_Msk                        /*!< Port PF12 Pull-Down set */
#define PWR_PDCRF_PD13_Pos           (13U)
#define PWR_PDCRF_PD13_Msk           (0x1UL << PWR_PDCRF_PD13_Pos)             /*!< 0x00002000 */
#define PWR_PDCRF_PD13               PWR_PDCRF_PD13_Msk                        /*!< Port PF13 Pull-Down set */
#define PWR_PDCRF_PD14_Pos           (14U)
#define PWR_PDCRF_PD14_Msk           (0x1UL << PWR_PDCRF_PD14_Pos)             /*!< 0x00004000 */
#define PWR_PDCRF_PD14               PWR_PDCRF_PD14_Msk                        /*!< Port PF14 Pull-Down set */
#define PWR_PDCRF_PD15_Pos           (15U)
#define PWR_PDCRF_PD15_Msk           (0x1UL << PWR_PDCRF_PD15_Pos)             /*!< 0x00008000 */
#define PWR_PDCRF_PD15               PWR_PDCRF_PD15_Msk                        /*!< Port PF15 Pull-Down set */

