ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32L5xx/stm32l552xx.h
/********************  Bit definition for PWR_PUCRG register  ********************/
#define PWR_PUCRG_PU0_Pos            (0U)
#define PWR_PUCRG_PU0_Msk            (0x1UL << PWR_PUCRG_PU0_Pos)              /*!< 0x00000001 */
#define PWR_PUCRG_PU0                PWR_PUCRG_PU0_Msk                         /*!< Port PG0 Pull-Up set  */
#define PWR_PUCRG_PU1_Pos            (1U)
#define PWR_PUCRG_PU1_Msk            (0x1UL << PWR_PUCRG_PU1_Pos)              /*!< 0x00000002 */
#define PWR_PUCRG_PU1                PWR_PUCRG_PU1_Msk                         /*!< Port PG1 Pull-Up set  */
#define PWR_PUCRG_PU2_Pos            (2U)
#define PWR_PUCRG_PU2_Msk            (0x1UL << PWR_PUCRG_PU2_Pos)              /*!< 0x00000004 */
#define PWR_PUCRG_PU2                PWR_PUCRG_PU2_Msk                         /*!< Port PG2 Pull-Up set  */
#define PWR_PUCRG_PU3_Pos            (3U)
#define PWR_PUCRG_PU3_Msk            (0x1UL << PWR_PUCRG_PU3_Pos)              /*!< 0x00000008 */
#define PWR_PUCRG_PU3                PWR_PUCRG_PU3_Msk                         /*!< Port PG3 Pull-Up set  */
#define PWR_PUCRG_PU4_Pos            (4U)
#define PWR_PUCRG_PU4_Msk            (0x1UL << PWR_PUCRG_PU4_Pos)              /*!< 0x00000010 */
#define PWR_PUCRG_PU4                PWR_PUCRG_PU4_Msk                         /*!< Port PG4 Pull-Up set  */
#define PWR_PUCRG_PU5_Pos            (5U)
#define PWR_PUCRG_PU5_Msk            (0x1UL << PWR_PUCRG_PU5_Pos)              /*!< 0x00000020 */
#define PWR_PUCRG_PU5                PWR_PUCRG_PU5_Msk                         /*!< Port PG5 Pull-Up set  */
#define PWR_PUCRG_PU6_Pos            (6U)
#define PWR_PUCRG_PU6_Msk            (0x1UL << PWR_PUCRG_PU6_Pos)              /*!< 0x00000040 */
#define PWR_PUCRG_PU6                PWR_PUCRG_PU6_Msk                         /*!< Port PG6 Pull-Up set  */
#define PWR_PUCRG_PU7_Pos            (7U)
#define PWR_PUCRG_PU7_Msk            (0x1UL << PWR_PUCRG_PU7_Pos)              /*!< 0x00000080 */
#define PWR_PUCRG_PU7                PWR_PUCRG_PU7_Msk                         /*!< Port PG7 Pull-Up set  */
#define PWR_PUCRG_PU8_Pos            (8U)
#define PWR_PUCRG_PU8_Msk            (0x1UL << PWR_PUCRG_PU8_Pos)              /*!< 0x00000100 */
#define PWR_PUCRG_PU8                PWR_PUCRG_PU8_Msk                         /*!< Port PG8 Pull-Up set  */
#define PWR_PUCRG_PU9_Pos            (9U)
#define PWR_PUCRG_PU9_Msk            (0x1UL << PWR_PUCRG_PU9_Pos)              /*!< 0x00000200 */
#define PWR_PUCRG_PU9                PWR_PUCRG_PU9_Msk                         /*!< Port PG9 Pull-Up set  */
#define PWR_PUCRG_PU10_Pos           (10U)
#define PWR_PUCRG_PU10_Msk           (0x1UL << PWR_PUCRG_PU10_Pos)             /*!< 0x00000400 */
#define PWR_PUCRG_PU10               PWR_PUCRG_PU10_Msk                        /*!< Port PG10 Pull-Up set */
#define PWR_PUCRG_PU11_Pos           (11U)
#define PWR_PUCRG_PU11_Msk           (0x1UL << PWR_PUCRG_PU11_Pos)             /*!< 0x00000800 */
#define PWR_PUCRG_PU11               PWR_PUCRG_PU11_Msk                        /*!< Port PG11 Pull-Up set */
#define PWR_PUCRG_PU12_Pos           (12U)
#define PWR_PUCRG_PU12_Msk           (0x1UL << PWR_PUCRG_PU12_Pos)             /*!< 0x00001000 */
#define PWR_PUCRG_PU12               PWR_PUCRG_PU12_Msk                        /*!< Port PG12 Pull-Up set */
#define PWR_PUCRG_PU13_Pos           (13U)
#define PWR_PUCRG_PU13_Msk           (0x1UL << PWR_PUCRG_PU13_Pos)             /*!< 0x00002000 */
#define PWR_PUCRG_PU13               PWR_PUCRG_PU13_Msk                        /*!< Port PG13 Pull-Up set */
#define PWR_PUCRG_PU14_Pos           (14U)
#define PWR_PUCRG_PU14_Msk           (0x1UL << PWR_PUCRG_PU14_Pos)             /*!< 0x00004000 */
#define PWR_PUCRG_PU14               PWR_PUCRG_PU14_Msk                        /*!< Port PG14 Pull-Up set */
#define PWR_PUCRG_PU15_Pos           (15U)
#define PWR_PUCRG_PU15_Msk           (0x1UL << PWR_PUCRG_PU15_Pos)             /*!< 0x00008000 */
#define PWR_PUCRG_PU15               PWR_PUCRG_PU15_Msk                        /*!< Port PG15 Pull-Up set */

/********************  Bit definition for PWR_PDCRG register  ********************/
#define PWR_PDCRG_PD0_Pos            (0U)
#define PWR_PDCRG_PD0_Msk            (0x1UL << PWR_PDCRG_PD0_Pos)              /*!< 0x00000001 */
#define PWR_PDCRG_PD0                PWR_PDCRG_PD0_Msk                         /*!< Port PG0 Pull-Down set  */
#define PWR_PDCRG_PD1_Pos            (1U)
#define PWR_PDCRG_PD1_Msk            (0x1UL << PWR_PDCRG_PD1_Pos)              /*!< 0x00000002 */
#define PWR_PDCRG_PD1                PWR_PDCRG_PD1_Msk                         /*!< Port PG1 Pull-Down set  */
#define PWR_PDCRG_PD2_Pos            (2U)
#define PWR_PDCRG_PD2_Msk            (0x1UL << PWR_PDCRG_PD2_Pos)              /*!< 0x00000004 */
#define PWR_PDCRG_PD2                PWR_PDCRG_PD2_Msk                         /*!< Port PG2 Pull-Down set  */
#define PWR_PDCRG_PD3_Pos            (3U)
#define PWR_PDCRG_PD3_Msk            (0x1UL << PWR_PDCRG_PD3_Pos)              /*!< 0x00000008 */
#define PWR_PDCRG_PD3                PWR_PDCRG_PD3_Msk                         /*!< Port PG3 Pull-Down set  */
#define PWR_PDCRG_PD4_Pos            (4U)
#define PWR_PDCRG_PD4_Msk            (0x1UL << PWR_PDCRG_PD4_Pos)              /*!< 0x00000010 */
#define PWR_PDCRG_PD4                PWR_PDCRG_PD4_Msk                         /*!< Port PG4 Pull-Down set  */
#define PWR_PDCRG_PD5_Pos            (5U)
#define PWR_PDCRG_PD5_Msk            (0x1UL << PWR_PDCRG_PD5_Pos)              /*!< 0x00000020 */
#define PWR_PDCRG_PD5                PWR_PDCRG_PD5_Msk                         /*!< Port PG5 Pull-Down set  */
#define PWR_PDCRG_PD6_Pos            (6U)
#define PWR_PDCRG_PD6_Msk            (0x1UL << PWR_PDCRG_PD6_Pos)              /*!< 0x00000040 */
#define PWR_PDCRG_PD6                PWR_PDCRG_PD6_Msk                         /*!< Port PG6 Pull-Down set  */
#define PWR_PDCRG_PD7_Pos            (7U)
#define PWR_PDCRG_PD7_Msk            (0x1UL << PWR_PDCRG_PD7_Pos)              /*!< 0x00000080 */
#define PWR_PDCRG_PD7                PWR_PDCRG_PD7_Msk                         /*!< Port PG7 Pull-Down set  */
#define PWR_PDCRG_PD8_Pos            (8U)
#define PWR_PDCRG_PD8_Msk            (0x1UL << PWR_PDCRG_PD8_Pos)              /*!< 0x00000100 */
#define PWR_PDCRG_PD8                PWR_PDCRG_PD8_Msk                         /*!< Port PG8 Pull-Down set  */
#define PWR_PDCRG_PD9_Pos            (9U)
#define PWR_PDCRG_PD9_Msk            (0x1UL << PWR_PDCRG_PD9_Pos)              /*!< 0x00000200 */
#define PWR_PDCRG_PD9                PWR_PDCRG_PD9_Msk                         /*!< Port PG9 Pull-Down set  */
#define PWR_PDCRG_PD10_Pos           (10U)
#define PWR_PDCRG_PD10_Msk           (0x1UL << PWR_PDCRG_PD10_Pos)             /*!< 0x00000400 */
#define PWR_PDCRG_PD10               PWR_PDCRG_PD10_Msk                        /*!< Port PG10 Pull-Down set */
#define PWR_PDCRG_PD11_Pos           (11U)
#define PWR_PDCRG_PD11_Msk           (0x1UL << PWR_PDCRG_PD11_Pos)             /*!< 0x00000800 */
#define PWR_PDCRG_PD11               PWR_PDCRG_PD11_Msk                        /*!< Port PG11 Pull-Down set */
#define PWR_PDCRG_PD12_Pos           (12U)
#define PWR_PDCRG_PD12_Msk           (0x1UL << PWR_PDCRG_PD12_Pos)             /*!< 0x00001000 */
#define PWR_PDCRG_PD12               PWR_PDCRG_PD12_Msk                        /*!< Port PG12 Pull-Down set */
#define PWR_PDCRG_PD13_Pos           (13U)
#define PWR_PDCRG_PD13_Msk           (0x1UL << PWR_PDCRG_PD13_Pos)             /*!< 0x00002000 */
#define PWR_PDCRG_PD13               PWR_PDCRG_PD13_Msk                        /*!< Port PG13 Pull-Down set */
#define PWR_PDCRG_PD14_Pos           (14U)
#define PWR_PDCRG_PD14_Msk           (0x1UL << PWR_PDCRG_PD14_Pos)             /*!< 0x00004000 */
#define PWR_PDCRG_PD14               PWR_PDCRG_PD14_Msk                        /*!< Port PG14 Pull-Down set */
#define PWR_PDCRG_PD15_Pos           (15U)
#define PWR_PDCRG_PD15_Msk           (0x1UL << PWR_PDCRG_PD15_Pos)             /*!< 0x00008000 */
#define PWR_PDCRG_PD15               PWR_PDCRG_PD15_Msk                        /*!< Port PG15 Pull-Down set */

