ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32L5xx/stm32l552xx.h
#define SAI_PDMDLY_DLYM4R_Pos      (28U)
#define SAI_PDMDLY_DLYM4R_Msk      (0x7UL << SAI_PDMDLY_DLYM4R_Pos)            /*!< 0x70000000 */
#define SAI_PDMDLY_DLYM4R          SAI_PDMDLY_DLYM4R_Msk                       /*!<DLYM4R[2:0] (Delay line adjust for right microphone of pair 4) */
#define SAI_PDMDLY_DLYM4R_0        (0x1UL << SAI_PDMDLY_DLYM4R_Pos)            /*!< 0x10000000 */
#define SAI_PDMDLY_DLYM4R_1        (0x2UL << SAI_PDMDLY_DLYM4R_Pos)            /*!< 0x20000000 */
#define SAI_PDMDLY_DLYM4R_2        (0x4UL << SAI_PDMDLY_DLYM4R_Pos)            /*!< 0x40000000 */

/******************************************************************************/
/*                                                                            */
/*                                 SYSCFG                                     */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for SYSCFG_SECCFGR register  **************/
#define SYSCFG_SECCFGR_SYSCFGSEC_Pos    (0U)
#define SYSCFG_SECCFGR_SYSCFGSEC_Msk    (0x1UL << SYSCFG_SECCFGR_SYSCFGSEC_Pos) /*!< 0x00000001 */
#define SYSCFG_SECCFGR_SYSCFGSEC        SYSCFG_SECCFGR_SYSCFGSEC_Msk            /*!< SYSCFG clock control security enable */
#define SYSCFG_SECCFGR_CLASSBSEC_Pos    (1U)
#define SYSCFG_SECCFGR_CLASSBSEC_Msk    (0x1UL << SYSCFG_SECCFGR_CLASSBSEC_Pos)  /*!< 0x00000002 */
#define SYSCFG_SECCFGR_CLASSBSEC        SYSCFG_SECCFGR_CLASSBSEC_Msk             /*!< ClassB SYSCFG security enable */
#define SYSCFG_SECCFGR_SRAM2SEC_Pos     (2U)
#define SYSCFG_SECCFGR_SRAM2SEC_Msk     (0x1UL << SYSCFG_SECCFGR_SRAM2SEC_Pos)   /*!< 0x00000004 */
#define SYSCFG_SECCFGR_SRAM2SEC         SYSCFG_SECCFGR_SRAM2SEC_Msk              /*!< SRAM2 SYSCFG security enable */
#define SYSCFG_SECCFGR_FPUSEC_Pos       (3U)
#define SYSCFG_SECCFGR_FPUSEC_Msk       (0x1UL << SYSCFG_SECCFGR_FPUSEC_Pos)     /*!< 0x00000008 */
#define SYSCFG_SECCFGR_FPUSEC           SYSCFG_SECCFGR_FPUSEC_Msk                /*!< FPU SYSCFG security enable */

/******************  Bit definition for SYSCFG_CFGR1 register  ****************/
#define SYSCFG_CFGR1_BOOSTEN_Pos        (8U)
#define SYSCFG_CFGR1_BOOSTEN_Msk        (0x1UL << SYSCFG_CFGR1_BOOSTEN_Pos)    /*!< 0x00000100 */
#define SYSCFG_CFGR1_BOOSTEN            SYSCFG_CFGR1_BOOSTEN_Msk               /*!< I/O analog switch voltage booster enable */
#define SYSCFG_CFGR1_ANASWVDD_Pos       (9U)
#define SYSCFG_CFGR1_ANASWVDD_Msk       (0x1UL << SYSCFG_CFGR1_ANASWVDD_Pos)   /*!< 0x00000200 */
#define SYSCFG_CFGR1_ANASWVDD           SYSCFG_CFGR1_ANASWVDD_Msk              /*!< GPIO analog switch control voltage selection enable */
#define SYSCFG_CFGR1_I2C_PB6_FMP_Pos    (16U)
#define SYSCFG_CFGR1_I2C_PB6_FMP_Msk    (0x1UL << SYSCFG_CFGR1_I2C_PB6_FMP_Pos)/*!< 0x00010000 */
#define SYSCFG_CFGR1_I2C_PB6_FMP        SYSCFG_CFGR1_I2C_PB6_FMP_Msk           /*!< I2C PB6 Fast mode plus */
#define SYSCFG_CFGR1_I2C_PB7_FMP_Pos    (17U)
#define SYSCFG_CFGR1_I2C_PB7_FMP_Msk    (0x1UL << SYSCFG_CFGR1_I2C_PB7_FMP_Pos)/*!< 0x00020000 */
#define SYSCFG_CFGR1_I2C_PB7_FMP        SYSCFG_CFGR1_I2C_PB7_FMP_Msk           /*!< I2C PB7 Fast mode plus */
#define SYSCFG_CFGR1_I2C_PB8_FMP_Pos    (18U)
#define SYSCFG_CFGR1_I2C_PB8_FMP_Msk    (0x1UL << SYSCFG_CFGR1_I2C_PB8_FMP_Pos)/*!< 0x00040000 */
#define SYSCFG_CFGR1_I2C_PB8_FMP        SYSCFG_CFGR1_I2C_PB8_FMP_Msk           /*!< I2C PB8 Fast mode plus */
#define SYSCFG_CFGR1_I2C_PB9_FMP_Pos    (19U)
#define SYSCFG_CFGR1_I2C_PB9_FMP_Msk    (0x1UL << SYSCFG_CFGR1_I2C_PB9_FMP_Pos)/*!< 0x00080000 */
#define SYSCFG_CFGR1_I2C_PB9_FMP        SYSCFG_CFGR1_I2C_PB9_FMP_Msk           /*!< I2C PB9 Fast mode plus */
#define SYSCFG_CFGR1_I2C1_FMP_Pos       (20U)
#define SYSCFG_CFGR1_I2C1_FMP_Msk       (0x1UL << SYSCFG_CFGR1_I2C1_FMP_Pos)   /*!< 0x00100000 */
#define SYSCFG_CFGR1_I2C1_FMP           SYSCFG_CFGR1_I2C1_FMP_Msk              /*!< I2C1 Fast mode plus */
#define SYSCFG_CFGR1_I2C2_FMP_Pos       (21U)
#define SYSCFG_CFGR1_I2C2_FMP_Msk       (0x1UL << SYSCFG_CFGR1_I2C2_FMP_Pos)   /*!< 0x00200000 */
#define SYSCFG_CFGR1_I2C2_FMP           SYSCFG_CFGR1_I2C2_FMP_Msk              /*!< I2C2 Fast mode plus */
#define SYSCFG_CFGR1_I2C3_FMP_Pos       (22U)
#define SYSCFG_CFGR1_I2C3_FMP_Msk       (0x1UL << SYSCFG_CFGR1_I2C3_FMP_Pos)   /*!< 0x00400000 */
#define SYSCFG_CFGR1_I2C3_FMP           SYSCFG_CFGR1_I2C3_FMP_Msk              /*!< I2C3 Fast mode plus */
#define SYSCFG_CFGR1_I2C4_FMP_Pos       (23U)
#define SYSCFG_CFGR1_I2C4_FMP_Msk       (0x1UL << SYSCFG_CFGR1_I2C4_FMP_Pos)   /*!< 0x00800000 */
#define SYSCFG_CFGR1_I2C4_FMP           SYSCFG_CFGR1_I2C4_FMP_Msk              /*!< I2C4 Fast mode plus */

/******************  Bit definition for SYSCFG_FPUIMR register  ***************/
#define SYSCFG_FPUIMR_FPU_IE_Pos        (0U)
#define SYSCFG_FPUIMR_FPU_IE_Msk        (0x3FUL << SYSCFG_FPUIMR_FPU_IE_Pos)   /*!< 0x0000003F */
#define SYSCFG_FPUIMR_FPU_IE            SYSCFG_FPUIMR_FPU_IE_Msk               /*!<  All FPU interrupts enable */
#define SYSCFG_FPUIMR_FPU_IE_0_Pos      (0U)
#define SYSCFG_FPUIMR_FPU_IE_0_Msk      (0x1UL << SYSCFG_FPUIMR_FPU_IE_0_Pos)  /*!< 0x00000001 */
#define SYSCFG_FPUIMR_FPU_IE_0          SYSCFG_FPUIMR_FPU_IE_0_Msk             /*!< Invalid operation Interrupt enable */
#define SYSCFG_FPUIMR_FPU_IE_1_Pos      (1U)
#define SYSCFG_FPUIMR_FPU_IE_1_Msk      (0x1UL << SYSCFG_FPUIMR_FPU_IE_1_Pos)  /*!< 0x00000002 */
#define SYSCFG_FPUIMR_FPU_IE_1          SYSCFG_FPUIMR_FPU_IE_1_Msk             /*!< Divide-by-zero Interrupt enable */
#define SYSCFG_FPUIMR_FPU_IE_2_Pos      (2U)
#define SYSCFG_FPUIMR_FPU_IE_2_Msk      (0x1UL << SYSCFG_FPUIMR_FPU_IE_2_Pos)  /*!< 0x00000004 */
#define SYSCFG_FPUIMR_FPU_IE_2          SYSCFG_FPUIMR_FPU_IE_2_Msk             /*!< Underflow Interrupt enable */
#define SYSCFG_FPUIMR_FPU_IE_3_Pos      (3U)
#define SYSCFG_FPUIMR_FPU_IE_3_Msk      (0x1UL << SYSCFG_FPUIMR_FPU_IE_3_Pos)  /*!< 0x00000008 */
#define SYSCFG_FPUIMR_FPU_IE_3          SYSCFG_FPUIMR_FPU_IE_3_Msk             /*!< Overflow Interrupt enable */
#define SYSCFG_FPUIMR_FPU_IE_4_Pos      (4U)
#define SYSCFG_FPUIMR_FPU_IE_4_Msk      (0x1UL << SYSCFG_FPUIMR_FPU_IE_4_Pos)  /*!< 0x00000010 */
#define SYSCFG_FPUIMR_FPU_IE_4          SYSCFG_FPUIMR_FPU_IE_4_Msk             /*!< Input denormal Interrupt enable */
#define SYSCFG_FPUIMR_FPU_IE_5_Pos      (5U)
#define SYSCFG_FPUIMR_FPU_IE_5_Msk      (0x1UL << SYSCFG_FPUIMR_FPU_IE_5_Pos)  /*!< 0x00000020 */
#define SYSCFG_FPUIMR_FPU_IE_5          SYSCFG_FPUIMR_FPU_IE_5_Msk             /*!< Inexact Interrupt enable */

/******************  Bit definition for SYSCFG_CNSLCKR register  **************/
#define SYSCFG_CNSLCKR_LOCKNSVTOR_Pos   (0U)
#define SYSCFG_CNSLCKR_LOCKNSVTOR_Msk   (0x1UL << SYSCFG_CNSLCKR_LOCKNSVTOR_Pos)/*!< 0x00000001 */
#define SYSCFG_CNSLCKR_LOCKNSVTOR       SYSCFG_CNSLCKR_LOCKNSVTOR_Msk          /*!< Disable VTOR_NS register writes by SW or debug agent */
#define SYSCFG_CNSLCKR_LOCKNSMPU_Pos    (1U)
#define SYSCFG_CNSLCKR_LOCKNSMPU_Msk    (0x1UL << SYSCFG_CNSLCKR_LOCKNSMPU_Pos)/*!< 0x00000002 */
#define SYSCFG_CNSLCKR_LOCKNSMPU        SYSCFG_CNSLCKR_LOCKNSMPU_Msk           /*!< Disable Non-Secure MPU registers writes by SW or debug agent */

/******************  Bit definition for SYSCFG_CSLCKR register  ***************/
#define SYSCFG_CSLCKR_LOCKSVTAIRCR_Pos  (0U)
#define SYSCFG_CSLCKR_LOCKSVTAIRCR_Msk  (0x1UL << SYSCFG_CSLCKR_LOCKSVTAIRCR_Pos)/*!< 0x00000001 */
#define SYSCFG_CSLCKR_LOCKSVTAIRCR      SYSCFG_CSLCKR_LOCKSVTAIRCR_Msk         /*!< Disable changes to the secure vectror table address, handling of system faults */
#define SYSCFG_CSLCKR_LOCKSMPU_Pos      (1U)
#define SYSCFG_CSLCKR_LOCKSMPU_Msk      (0x1UL << SYSCFG_CSLCKR_LOCKSMPU_Pos)  /*!< 0x00000002 */
#define SYSCFG_CSLCKR_LOCKSMPU          SYSCFG_CSLCKR_LOCKSMPU_Msk             /*!< Disable changes to the secure MPU registers writes by SW or debug agent */
#define SYSCFG_CSLCKR_LOCKSAU_Pos       (2U)
#define SYSCFG_CSLCKR_LOCKSAU_Msk       (0x1UL << SYSCFG_CSLCKR_LOCKSAU_Pos)   /*!< 0x00000002 */
#define SYSCFG_CSLCKR_LOCKSAU           SYSCFG_CSLCKR_LOCKSAU_Msk              /*!< Disable changes to SAU registers */

/******************  Bit definition for SYSCFG_CFGR2 register  ****************/
#define SYSCFG_CFGR2_CLL_Pos            (0U)
#define SYSCFG_CFGR2_CLL_Msk            (0x1UL << SYSCFG_CFGR2_CLL_Pos)        /*!< 0x00000001 */
#define SYSCFG_CFGR2_CLL                SYSCFG_CFGR2_CLL_Msk                   /*!< Core Lockup Lock */
#define SYSCFG_CFGR2_SPL_Pos            (1U)
#define SYSCFG_CFGR2_SPL_Msk            (0x1UL << SYSCFG_CFGR2_SPL_Pos)        /*!< 0x00000002 */
#define SYSCFG_CFGR2_SPL                SYSCFG_CFGR2_SPL_Msk                   /*!< SRAM Parity Lock*/
#define SYSCFG_CFGR2_PVDL_Pos           (2U)
#define SYSCFG_CFGR2_PVDL_Msk           (0x1UL << SYSCFG_CFGR2_PVDL_Pos)       /*!< 0x00000004 */
#define SYSCFG_CFGR2_PVDL               SYSCFG_CFGR2_PVDL_Msk                  /*!<  PVD Lock */
#define SYSCFG_CFGR2_ECCL_Pos           (3U)
#define SYSCFG_CFGR2_ECCL_Msk           (0x1UL << SYSCFG_CFGR2_ECCL_Pos)       /*!< 0x00000008 */
#define SYSCFG_CFGR2_ECCL               SYSCFG_CFGR2_ECCL_Msk                  /*!< ECC Lock*/
#define SYSCFG_CFGR2_SPF_Pos            (8U)
#define SYSCFG_CFGR2_SPF_Msk            (0x1UL << SYSCFG_CFGR2_SPF_Pos)        /*!< 0x00000100 */
#define SYSCFG_CFGR2_SPF                SYSCFG_CFGR2_SPF_Msk                   /*!< SRAM Parity Flag */

/******************  Bit definition for SYSCFG_SCSR register  *****************/
#define SYSCFG_SCSR_SRAM2ER_Pos         (0U)
#define SYSCFG_SCSR_SRAM2ER_Msk         (0x1UL << SYSCFG_SCSR_SRAM2ER_Pos)     /*!< 0x00000001 */
#define SYSCFG_SCSR_SRAM2ER             SYSCFG_SCSR_SRAM2ER_Msk                /*!< SRAM2 Erase Request */
#define SYSCFG_SCSR_SRAM2BSY_Pos        (1U)
#define SYSCFG_SCSR_SRAM2BSY_Msk        (0x1UL << SYSCFG_SCSR_SRAM2BSY_Pos)    /*!< 0x00000002 */
#define SYSCFG_SCSR_SRAM2BSY            SYSCFG_SCSR_SRAM2BSY_Msk               /*!< SRAM2 Erase Ongoing */

