ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32L5xx/stm32l552xx.h
/******************  Bit definition for SYSCFG_SKR register  *****************/
#define SYSCFG_SKR_KEY_Pos              (0U)
#define SYSCFG_SKR_KEY_Msk              (0xFFUL << SYSCFG_SKR_KEY_Pos)         /*!< 0x000000FF */
#define SYSCFG_SKR_KEY                  SYSCFG_SKR_KEY_Msk                     /*!<  SRAM2 write protection key for software erase  */

/******************  Bit definition for SYSCFG_SWPR register  *****************/
#define SYSCFG_SWPR_P0WP_Pos            (0U)
#define SYSCFG_SWPR_P0WP_Msk            (0x1UL << SYSCFG_SWPR_P0WP_Pos)        /*!< 0x00000001 */
#define SYSCFG_SWPR_P0WP                SYSCFG_SWPR_P0WP_Msk                  /*!< SRAM2 Write protection page 0 */
#define SYSCFG_SWPR_P1WP_Pos            (1U)
#define SYSCFG_SWPR_P1WP_Msk            (0x1UL << SYSCFG_SWPR_P1WP_Pos)        /*!< 0x00000002 */
#define SYSCFG_SWPR_P1WP                SYSCFG_SWPR_P1WP_Msk                  /*!< SRAM2 Write protection page 1 */
#define SYSCFG_SWPR_P2WP_Pos            (2U)
#define SYSCFG_SWPR_P2WP_Msk            (0x1UL << SYSCFG_SWPR_P2WP_Pos)        /*!< 0x00000004 */
#define SYSCFG_SWPR_P2WP                SYSCFG_SWPR_P2WP_Msk                   /*!< SRAM2 Write protection page 2 */
#define SYSCFG_SWPR_P3WP_Pos            (3U)
#define SYSCFG_SWPR_P3WP_Msk            (0x1UL << SYSCFG_SWPR_P3WP_Pos)        /*!< 0x00000008 */
#define SYSCFG_SWPR_P3WP                SYSCFG_SWPR_P3WP_Msk                   /*!< SRAM2 Write protection page 3 */
#define SYSCFG_SWPR_P4WP_Pos            (4U)
#define SYSCFG_SWPR_P4WP_Msk            (0x1UL << SYSCFG_SWPR_P4WP_Pos)        /*!< 0x00000010 */
#define SYSCFG_SWPR_P4WP                SYSCFG_SWPR_P4WP_Msk                   /*!< SRAM2 Write protection page 4 */
#define SYSCFG_SWPR_P5WP_Pos            (5U)
#define SYSCFG_SWPR_P5WP_Msk            (0x1UL << SYSCFG_SWPR_P5WP_Pos)        /*!< 0x00000020 */
#define SYSCFG_SWPR_P5WP                SYSCFG_SWPR_P5WP_Msk                   /*!< SRAM2 Write protection page 5 */
#define SYSCFG_SWPR_P6WP_Pos            (6U)
#define SYSCFG_SWPR_P6WP_Msk            (0x1UL << SYSCFG_SWPR_P6WP_Pos)        /*!< 0x00000040 */
#define SYSCFG_SWPR_P6WP                SYSCFG_SWPR_P6WP_Msk                   /*!< SRAM2 Write protection page 6 */
#define SYSCFG_SWPR_P7WP_Pos            (7U)
#define SYSCFG_SWPR_P7WP_Msk            (0x1UL << SYSCFG_SWPR_P7WP_Pos)        /*!< 0x00000080 */
#define SYSCFG_SWPR_P7WP                SYSCFG_SWPR_P7WP_Msk                   /*!< SRAM2 Write protection page 7 */
#define SYSCFG_SWPR_P8WP_Pos            (8U)
#define SYSCFG_SWPR_P8WP_Msk            (0x1UL << SYSCFG_SWPR_P8WP_Pos)        /*!< 0x00000100 */
#define SYSCFG_SWPR_P8WP                SYSCFG_SWPR_P8WP_Msk                   /*!< SRAM2 Write protection page 8 */
#define SYSCFG_SWPR_P9WP_Pos            (9U)
#define SYSCFG_SWPR_P9WP_Msk            (0x1UL << SYSCFG_SWPR_P9WP_Pos)        /*!< 0x00000200 */
#define SYSCFG_SWPR_P9WP                SYSCFG_SWPR_P9WP_Msk                   /*!< SRAM2 Write protection page 9 */
#define SYSCFG_SWPR_P10WP_Pos           (10U)
#define SYSCFG_SWPR_P10WP_Msk           (0x1UL << SYSCFG_SWPR_P10WP_Pos)       /*!< 0x00000400 */
#define SYSCFG_SWPR_P10WP               SYSCFG_SWPR_P10WP_Msk                  /*!< SRAM2 Write protection page 10*/
#define SYSCFG_SWPR_P11WP_Pos           (11U)
#define SYSCFG_SWPR_P11WP_Msk           (0x1UL << SYSCFG_SWPR_P11WP_Pos)       /*!< 0x00000800 */
#define SYSCFG_SWPR_P11WP               SYSCFG_SWPR_P11WP_Msk                  /*!< SRAM2 Write protection page 11*/
#define SYSCFG_SWPR_P12WP_Pos           (12U)
#define SYSCFG_SWPR_P12WP_Msk           (0x1UL << SYSCFG_SWPR_P12WP_Pos)       /*!< 0x00001000 */
#define SYSCFG_SWPR_P12WP               SYSCFG_SWPR_P12WP_Msk                  /*!< SRAM2 Write protection page 12*/
#define SYSCFG_SWPR_P13WP_Pos           (13U)
#define SYSCFG_SWPR_P13WP_Msk           (0x1UL << SYSCFG_SWPR_P13WP_Pos)       /*!< 0x00002000 */
#define SYSCFG_SWPR_P13WP               SYSCFG_SWPR_P13WP_Msk                  /*!< SRAM2 Write protection page 13*/
#define SYSCFG_SWPR_P14WP_Pos           (14U)
#define SYSCFG_SWPR_P14WP_Msk           (0x1UL << SYSCFG_SWPR_P14WP_Pos)       /*!< 0x00004000 */
#define SYSCFG_SWPR_P14WP               SYSCFG_SWPR_P14WP_Msk                  /*!< SRAM2 Write protection page 14*/
#define SYSCFG_SWPR_P15WP_Pos           (15U)
#define SYSCFG_SWPR_P15WP_Msk           (0x1UL << SYSCFG_SWPR_P15WP_Pos)       /*!< 0x00008000 */
#define SYSCFG_SWPR_P15WP               SYSCFG_SWPR_P15WP_Msk                  /*!< SRAM2 Write protection page 15*/
#define SYSCFG_SWPR_P16WP_Pos           (16U)
#define SYSCFG_SWPR_P16WP_Msk           (0x1UL << SYSCFG_SWPR_P16WP_Pos)       /*!< 0x00010000 */
#define SYSCFG_SWPR_P16WP               SYSCFG_SWPR_P16WP_Msk                  /*!< SRAM2 Write protection page 16*/
#define SYSCFG_SWPR_P17WP_Pos           (17U)
#define SYSCFG_SWPR_P17WP_Msk           (0x1UL << SYSCFG_SWPR_P17WP_Pos)       /*!< 0x00020000 */
#define SYSCFG_SWPR_P17WP               SYSCFG_SWPR_P17WP_Msk                  /*!< SRAM2 Write protection page 17*/
#define SYSCFG_SWPR_P18WP_Pos           (18U)
#define SYSCFG_SWPR_P18WP_Msk           (0x1UL << SYSCFG_SWPR_P18WP_Pos)       /*!< 0x00040000 */
#define SYSCFG_SWPR_P18WP               SYSCFG_SWPR_P18WP_Msk                  /*!< SRAM2 Write protection page 18*/
#define SYSCFG_SWPR_P19WP_Pos           (19U)
#define SYSCFG_SWPR_P19WP_Msk           (0x1UL << SYSCFG_SWPR_P19WP_Pos)       /*!< 0x00080000 */
#define SYSCFG_SWPR_P19WP               SYSCFG_SWPR_P19WP_Msk                  /*!< SRAM2 Write protection page 19*/
#define SYSCFG_SWPR_P20WP_Pos           (20U)
#define SYSCFG_SWPR_P20WP_Msk           (0x1UL << SYSCFG_SWPR_P20WP_Pos)       /*!< 0x00100000 */
#define SYSCFG_SWPR_P20WP               SYSCFG_SWPR_P20WP_Msk                  /*!< SRAM2 Write protection page 20*/
#define SYSCFG_SWPR_P21WP_Pos           (21U)
#define SYSCFG_SWPR_P21WP_Msk           (0x1UL << SYSCFG_SWPR_P21WP_Pos)       /*!< 0x00200000 */
#define SYSCFG_SWPR_P21WP               SYSCFG_SWPR_P21WP_Msk                  /*!< SRAM2 Write protection page 21*/
#define SYSCFG_SWPR_P22WP_Pos           (22U)
#define SYSCFG_SWPR_P22WP_Msk           (0x1UL << SYSCFG_SWPR_P22WP_Pos)       /*!< 0x00400000 */
#define SYSCFG_SWPR_P22WP               SYSCFG_SWPR_P22WP_Msk                  /*!< SRAM2 Write protection page 22*/
#define SYSCFG_SWPR_P23WP_Pos           (23U)
#define SYSCFG_SWPR_P23WP_Msk           (0x1UL << SYSCFG_SWPR_P23WP_Pos)       /*!< 0x00800000 */
#define SYSCFG_SWPR_P23WP               SYSCFG_SWPR_P23WP_Msk                  /*!< SRAM2 Write protection page 23*/
#define SYSCFG_SWPR_P24WP_Pos           (24U)
#define SYSCFG_SWPR_P24WP_Msk           (0x1UL << SYSCFG_SWPR_P24WP_Pos)       /*!< 0x01000000 */
#define SYSCFG_SWPR_P24WP               SYSCFG_SWPR_P24WP_Msk                  /*!< SRAM2 Write protection page 24*/
#define SYSCFG_SWPR_P25WP_Pos           (25U)
#define SYSCFG_SWPR_P25WP_Msk           (0x1UL << SYSCFG_SWPR_P25WP_Pos)       /*!< 0x02000000 */
#define SYSCFG_SWPR_P25WP               SYSCFG_SWPR_P25WP_Msk                 /*!< SRAM2 Write protection page 25*/
#define SYSCFG_SWPR_P26WP_Pos           (26U)
#define SYSCFG_SWPR_P26WP_Msk           (0x1UL << SYSCFG_SWPR_P26WP_Pos)       /*!< 0x04000000 */
#define SYSCFG_SWPR_P26WP               SYSCFG_SWPR_P26WP_Msk                  /*!< SRAM2 Write protection page 26*/
#define SYSCFG_SWPR_P27WP_Pos           (27U)
#define SYSCFG_SWPR_P27WP_Msk           (0x1UL << SYSCFG_SWPR_P27WP_Pos)       /*!< 0x08000000 */
#define SYSCFG_SWPR_P27WP               SYSCFG_SWPR_P27WP_Msk                  /*!< SRAM2 Write protection page 27*/
#define SYSCFG_SWPR_P28WP_Pos           (28U)
#define SYSCFG_SWPR_P28WP_Msk           (0x1UL << SYSCFG_SWPR_P28WP_Pos)       /*!< 0x10000000 */
#define SYSCFG_SWPR_P28WP               SYSCFG_SWPR_P28WP_Msk                  /*!< SRAM2 Write protection page 28*/
#define SYSCFG_SWPR_P29WP_Pos           (29U)
#define SYSCFG_SWPR_P29WP_Msk           (0x1UL << SYSCFG_SWPR_P29WP_Pos)       /*!< 0x20000000 */
#define SYSCFG_SWPR_P29WP               SYSCFG_SWPR_P29WP_Msk                  /*!< SRAM2 Write protection page 29*/
#define SYSCFG_SWPR_P30WP_Pos           (30U)
#define SYSCFG_SWPR_P30WP_Msk           (0x1UL << SYSCFG_SWPR_P30WP_Pos)       /*!< 0x40000000 */
#define SYSCFG_SWPR_P30WP               SYSCFG_SWPR_P30WP_Msk                  /*!< SRAM2 Write protection page 30*/
#define SYSCFG_SWPR_P31WP_Pos           (31U)
#define SYSCFG_SWPR_P31WP_Msk           (0x1UL << SYSCFG_SWPR_P31WP_Pos)       /*!< 0x80000000 */
#define SYSCFG_SWPR_P31WP               SYSCFG_SWPR_P31WP_Msk                  /*!< SRAM2 Write protection page 31*/

/******************  Bit definition for SYSCFG_SWPR2 register  ****************/
#define SYSCFG_SWPR2_P32WP_Pos          (0U)
#define SYSCFG_SWPR2_P32WP_Msk          (0x1UL << SYSCFG_SWPR2_P32WP_Pos)      /*!< 0x00000001 */
#define SYSCFG_SWPR2_P32WP              SYSCFG_SWPR2_P32WP_Msk                 /*!< SRAM2 Write protection page 32*/
#define SYSCFG_SWPR2_P33WP_Pos          (1U)
#define SYSCFG_SWPR2_P33WP_Msk          (0x1UL << SYSCFG_SWPR2_P33WP_Pos)      /*!< 0x00000002 */
#define SYSCFG_SWPR2_P33WP              SYSCFG_SWPR2_P33WP_Msk                 /*!< SRAM2 Write protection page 33*/
#define SYSCFG_SWPR2_P34WP_Pos          (2U)
#define SYSCFG_SWPR2_P34WP_Msk          (0x1UL << SYSCFG_SWPR2_P34WP_Pos)      /*!< 0x00000004 */
#define SYSCFG_SWPR2_P34WP              SYSCFG_SWPR2_P34WP_Msk                 /*!< SRAM2 Write protection page 34*/
#define SYSCFG_SWPR2_P35WP_Pos          (3U)
#define SYSCFG_SWPR2_P35WP_Msk          (0x1UL << SYSCFG_SWPR2_P35WP_Pos)      /*!< 0x00000008 */
#define SYSCFG_SWPR2_P35WP              SYSCFG_SWPR2_P35WP_Msk                 /*!< SRAM2 Write protection page 35*/
#define SYSCFG_SWPR2_P36WP_Pos          (4U)
#define SYSCFG_SWPR2_P36WP_Msk          (0x1UL << SYSCFG_SWPR2_P36WP_Pos)      /*!< 0x00000010 */
#define SYSCFG_SWPR2_P36WP              SYSCFG_SWPR2_P36WP_Msk                 /*!< SRAM2 Write protection page 36*/
#define SYSCFG_SWPR2_P37WP_Pos          (5U)
#define SYSCFG_SWPR2_P37WP_Msk          (0x1UL << SYSCFG_SWPR2_P37WP_Pos)      /*!< 0x00000020 */
#define SYSCFG_SWPR2_P37WP              SYSCFG_SWPR2_P37WP_Msk                 /*!< SRAM2 Write protection page 37*/
#define SYSCFG_SWPR2_P38WP_Pos          (6U)
#define SYSCFG_SWPR2_P38WP_Msk          (0x1UL << SYSCFG_SWPR2_P38WP_Pos)      /*!< 0x00000040 */
#define SYSCFG_SWPR2_P38WP              SYSCFG_SWPR2_P38WP_Msk                 /*!< SRAM2 Write protection page 38*/
#define SYSCFG_SWPR2_P39WP_Pos          (7U)
#define SYSCFG_SWPR2_P39WP_Msk          (0x1UL << SYSCFG_SWPR2_P39WP_Pos)      /*!< 0x00000080 */
#define SYSCFG_SWPR2_P39WP              SYSCFG_SWPR2_P39WP_Msk                 /*!< SRAM2 Write protection page 39*/
#define SYSCFG_SWPR2_P40WP_Pos          (8U)
#define SYSCFG_SWPR2_P40WP_Msk          (0x1UL << SYSCFG_SWPR2_P40WP_Pos)      /*!< 0x00000100 */
#define SYSCFG_SWPR2_P40WP              SYSCFG_SWPR2_P40WP_Msk                 /*!< SRAM2 Write protection page 40*/
#define SYSCFG_SWPR2_P41WP_Pos          (9U)
#define SYSCFG_SWPR2_P41WP_Msk          (0x1UL << SYSCFG_SWPR2_P41WP_Pos)      /*!< 0x00000200 */
#define SYSCFG_SWPR2_P41WP              SYSCFG_SWPR2_P41WP_Msk                 /*!< SRAM2 Write protection page 41*/
#define SYSCFG_SWPR2_P42WP_Pos          (10U)
#define SYSCFG_SWPR2_P42WP_Msk          (0x1UL << SYSCFG_SWPR2_P42WP_Pos)      /*!< 0x00000400 */
#define SYSCFG_SWPR2_P42WP              SYSCFG_SWPR2_P42WP_Msk                 /*!< SRAM2 Write protection page 42*/
#define SYSCFG_SWPR2_P43WP_Pos          (11U)
#define SYSCFG_SWPR2_P43WP_Msk          (0x1UL << SYSCFG_SWPR2_P43WP_Pos)      /*!< 0x00000800 */
#define SYSCFG_SWPR2_P43WP              SYSCFG_SWPR2_P43WP_Msk                 /*!< SRAM2 Write protection page 43*/
#define SYSCFG_SWPR2_P44WP_Pos          (12U)
#define SYSCFG_SWPR2_P44WP_Msk          (0x1UL << SYSCFG_SWPR2_P44WP_Pos)      /*!< 0x00001000 */
#define SYSCFG_SWPR2_P44WP              SYSCFG_SWPR2_P44WP_Msk                 /*!< SRAM2 Write protection page 44*/
#define SYSCFG_SWPR2_P45WP_Pos          (13U)
#define SYSCFG_SWPR2_P45WP_Msk          (0x1UL << SYSCFG_SWPR2_P45WP_Pos)      /*!< 0x00002000 */
#define SYSCFG_SWPR2_P45WP              SYSCFG_SWPR2_P45WP_Msk                 /*!< SRAM2 Write protection page 45*/
#define SYSCFG_SWPR2_P46WP_Pos          (14U)
#define SYSCFG_SWPR2_P46WP_Msk          (0x1UL << SYSCFG_SWPR2_P46WP_Pos)      /*!< 0x00004000 */
#define SYSCFG_SWPR2_P46WP              SYSCFG_SWPR2_P46WP_Msk                 /*!< SRAM2 Write protection page 46*/
#define SYSCFG_SWPR2_P47WP_Pos          (15U)
#define SYSCFG_SWPR2_P47WP_Msk          (0x1UL << SYSCFG_SWPR2_P47WP_Pos)      /*!< 0x00008000 */
#define SYSCFG_SWPR2_P47WP              SYSCFG_SWPR2_P47WP_Msk                 /*!< SRAM2 Write protection page 47*/
#define SYSCFG_SWPR2_P48WP_Pos          (16U)
#define SYSCFG_SWPR2_P48WP_Msk          (0x1UL << SYSCFG_SWPR2_P48WP_Pos)      /*!< 0x00010000 */
#define SYSCFG_SWPR2_P48WP              SYSCFG_SWPR2_P48WP_Msk                 /*!< SRAM2 Write protection page 48*/
#define SYSCFG_SWPR2_P49WP_Pos          (17U)
#define SYSCFG_SWPR2_P49WP_Msk          (0x1UL << SYSCFG_SWPR2_P49WP_Pos)      /*!< 0x00020000 */
#define SYSCFG_SWPR2_P49WP              SYSCFG_SWPR2_P49WP_Msk                 /*!< SRAM2 Write protection page 49*/
#define SYSCFG_SWPR2_P50WP_Pos          (18U)
#define SYSCFG_SWPR2_P50WP_Msk          (0x1UL << SYSCFG_SWPR2_P50WP_Pos)      /*!< 0x00040000 */
#define SYSCFG_SWPR2_P50WP              SYSCFG_SWPR2_P50WP_Msk                 /*!< SRAM2 Write protection page 50*/
#define SYSCFG_SWPR2_P51WP_Pos          (19U)
#define SYSCFG_SWPR2_P51WP_Msk          (0x1UL << SYSCFG_SWPR2_P51WP_Pos)      /*!< 0x00080000 */
#define SYSCFG_SWPR2_P51WP              SYSCFG_SWPR2_P51WP_Msk                 /*!< SRAM2 Write protection page 51*/
#define SYSCFG_SWPR2_P52WP_Pos          (20U)
#define SYSCFG_SWPR2_P52WP_Msk          (0x1UL << SYSCFG_SWPR2_P52WP_Pos)      /*!< 0x00100000 */
#define SYSCFG_SWPR2_P52WP              SYSCFG_SWPR2_P52WP_Msk                 /*!< SRAM2 Write protection page 52*/
#define SYSCFG_SWPR2_P53WP_Pos          (21U)
#define SYSCFG_SWPR2_P53WP_Msk          (0x1UL << SYSCFG_SWPR2_P53WP_Pos)      /*!< 0x00200000 */
#define SYSCFG_SWPR2_P53WP              SYSCFG_SWPR2_P53WP_Msk                 /*!< SRAM2 Write protection page 53*/
#define SYSCFG_SWPR2_P54WP_Pos          (22U)
#define SYSCFG_SWPR2_P54WP_Msk          (0x1UL << SYSCFG_SWPR2_P54WP_Pos)      /*!< 0x00400000 */
#define SYSCFG_SWPR2_P54WP              SYSCFG_SWPR2_P54WP_Msk                 /*!< SRAM2 Write protection page 54*/
#define SYSCFG_SWPR2_P55WP_Pos          (23U)
#define SYSCFG_SWPR2_P55WP_Msk          (0x1UL << SYSCFG_SWPR2_P55WP_Pos)      /*!< 0x00800000 */
#define SYSCFG_SWPR2_P55WP              SYSCFG_SWPR2_P55WP_Msk                 /*!< SRAM2 Write protection page 55*/
#define SYSCFG_SWPR2_P56WP_Pos          (24U)
#define SYSCFG_SWPR2_P56WP_Msk          (0x1UL << SYSCFG_SWPR2_P56WP_Pos)      /*!< 0x01000000 */
#define SYSCFG_SWPR2_P56WP              SYSCFG_SWPR2_P56WP_Msk                 /*!< SRAM2 Write protection page 56*/
#define SYSCFG_SWPR2_P57WP_Pos          (25U)
#define SYSCFG_SWPR2_P57WP_Msk          (0x1UL << SYSCFG_SWPR2_P57WP_Pos)      /*!< 0x02000000 */
#define SYSCFG_SWPR2_P57WP              SYSCFG_SWPR2_P57WP_Msk                 /*!< SRAM2 Write protection page 57*/
#define SYSCFG_SWPR2_P58WP_Pos          (26U)
#define SYSCFG_SWPR2_P58WP_Msk          (0x1UL << SYSCFG_SWPR2_P58WP_Pos)      /*!< 0x04000000 */
#define SYSCFG_SWPR2_P58WP              SYSCFG_SWPR2_P58WP_Msk                 /*!< SRAM2 Write protection page 58*/
#define SYSCFG_SWPR2_P59WP_Pos          (27U)
#define SYSCFG_SWPR2_P59WP_Msk          (0x1UL << SYSCFG_SWPR2_P59WP_Pos)      /*!< 0x08000000 */
#define SYSCFG_SWPR2_P59WP              SYSCFG_SWPR2_P59WP_Msk                 /*!< SRAM2 Write protection page 59*/
#define SYSCFG_SWPR2_P60WP_Pos          (28U)
#define SYSCFG_SWPR2_P60WP_Msk          (0x1UL << SYSCFG_SWPR2_P60WP_Pos)      /*!< 0x10000000 */
#define SYSCFG_SWPR2_P60WP              SYSCFG_SWPR2_P60WP_Msk                 /*!< SRAM2 Write protection page 60*/
#define SYSCFG_SWPR2_P61WP_Pos          (29U)
#define SYSCFG_SWPR2_P61WP_Msk          (0x1UL << SYSCFG_SWPR2_P61WP_Pos)      /*!< 0x20000000 */
#define SYSCFG_SWPR2_P61WP              SYSCFG_SWPR2_P61WP_Msk                 /*!< SRAM2 Write protection page 61*/
#define SYSCFG_SWPR2_P62WP_Pos          (30U)
#define SYSCFG_SWPR2_P62WP_Msk          (0x1UL << SYSCFG_SWPR2_P62WP_Pos)      /*!< 0x40000000 */
#define SYSCFG_SWPR2_P62WP              SYSCFG_SWPR2_P62WP_Msk                 /*!< SRAM2 Write protection page 62*/
#define SYSCFG_SWPR2_P63WP_Pos          (31U)
#define SYSCFG_SWPR2_P63WP_Msk          (0x1UL << SYSCFG_SWPR2_P63WP_Pos)      /*!< 0x80000000 */
#define SYSCFG_SWPR2_P63WP              SYSCFG_SWPR2_P63WP_Msk                 /*!< SRAM2 Write protection page 63*/

/******************  Bit definition for SYSCFG_RSSCMDR register  **************/
#define SYSCFG_RSSCMDR_RSSCMD_Pos       (0U)
#define SYSCFG_RSSCMDR_RSSCMD_Msk       (0xFFFFUL << SYSCFG_RSSCMDR_RSSCMD_Pos) /*!< 0x0000FFFF */
#define SYSCFG_RSSCMDR_RSSCMD           SYSCFG_RSSCMDR_RSSCMD_Msk              /*!< RSS commands */

#define SYSCFG_RSSCMDR_RSSCMD_BOOTLOADER ((uint16_t)0x01C0U)

/*****************************************************************************/
/*                                                                           */
/*                        Global TrustZone Control                           */
/*                                                                           */
/*****************************************************************************/
/*******************  Bits definition for GTZC_TZSC_CR register  ******************/
#define GTZC_TZSC_CR_LCK_Pos    (0U)
#define GTZC_TZSC_CR_LCK_Msk    (0x01UL << GTZC_TZSC_CR_LCK_Pos)    /*!< 0x00000001 */

/*******************  Bits definition for GTZC_TZSC_MPCWM1_NSWMR1 register  *******/
#define GTZC_TZSC_MPCWM1_NSWMR1_NSWM1STRT_Pos (0U)
#define GTZC_TZSC_MPCWM1_NSWMR1_NSWM1STRT_Msk (0x7FFUL << GTZC_TZSC_MPCWM1_NSWMR1_NSWM1STRT_Pos)
#define GTZC_TZSC_MPCWM1_NSWMR1_NSWM1LGTH_Pos (16U)
#define GTZC_TZSC_MPCWM1_NSWMR1_NSWM1LGTH_Msk (0xFFFUL << GTZC_TZSC_MPCWM1_NSWMR1_NSWM1LGTH_Pos)

