ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32L5xx/stm32l552xx.h
/*******************  Bits definition for GTZC_TZSC_MPCWM1_NSWMR2 register  *******/
#define GTZC_TZSC_MPCWM1_NSWMR2_NSWM2STRT_Pos (0U)
#define GTZC_TZSC_MPCWM1_NSWMR2_NSWM2STRT_Msk (0x7FFUL << GTZC_TZSC_MPCWM1_NSWMR2_NSWM2STRT_Pos)
#define GTZC_TZSC_MPCWM1_NSWMR2_NSWM2LGTH_Pos (16U)
#define GTZC_TZSC_MPCWM1_NSWMR2_NSWM2LGTH_Msk (0xFFFUL << GTZC_TZSC_MPCWM1_NSWMR2_NSWM2LGTH_Pos)

/*******************  Bits definition for GTZC_TZSC_MPCWM2_NSWMR1 register  *******/
#define GTZC_TZSC_MPCWM2_NSWMR1_NSWM1STRT_Pos (0U)
#define GTZC_TZSC_MPCWM2_NSWMR1_NSWM1STRT_Msk (0x7FFUL << GTZC_TZSC_MPCWM2_NSWMR1_NSWM1STRT_Pos)
#define GTZC_TZSC_MPCWM2_NSWMR1_NSWM1LGTH_Pos (16U)
#define GTZC_TZSC_MPCWM2_NSWMR1_NSWM1LGTH_Msk (0xFFFUL << GTZC_TZSC_MPCWM2_NSWMR1_NSWM1LGTH_Pos)

/*******************  Bits definition for GTZC_TZSC_MPCWM2_NSWMR2 register  *******/
#define GTZC_TZSC_MPCWM2_NSWMR2_NSWM2STRT_Pos (0U)
#define GTZC_TZSC_MPCWM2_NSWMR2_NSWM2STRT_Msk (0x7FFUL << GTZC_TZSC_MPCWM2_NSWMR2_NSWM2STRT_Pos)
#define GTZC_TZSC_MPCWM2_NSWMR2_NSWM2LGTH_Pos (16U)
#define GTZC_TZSC_MPCWM2_NSWMR2_NSWM2LGTH_Msk (0xFFFUL << GTZC_TZSC_MPCWM2_NSWMR2_NSWM2LGTH_Pos)

/*******************  Bits definition for GTZC_TZSC_MPCWM3_NSWMR1 register  *******/
#define GTZC_TZSC_MPCWM3_NSWMR1_NSWM1STRT_Pos (0U)
#define GTZC_TZSC_MPCWM3_NSWMR1_NSWM1STRT_Msk (0x7FFUL << GTZC_TZSC_MPCWM3_NSWMR1_NSWM1STRT_Pos)
#define GTZC_TZSC_MPCWM3_NSWMR1_NSWM1LGTH_Pos (16U)
#define GTZC_TZSC_MPCWM3_NSWMR1_NSWM1LGTH_Msk (0xFFFUL << GTZC_TZSC_MPCWM3_NSWMR1_NSWM1LGTH_Pos)

/*******  Bits definition for GTZC_TZSC_SECCFGRx/_PRIVCFGRx registers  *****/
/*******  Bits definition for GTZC_TZIC_IERx/_SRx/_IFCRx registers  ********/

/*******************  Bits definition for registers x=1  ***************/
#define GTZC_CFGR1_SPI1_Pos     (31U)
#define GTZC_CFGR1_SPI1_Msk     ( 0x01UL << GTZC_CFGR1_SPI1_Pos )
#define GTZC_CFGR1_TIM1_Pos     (30U)
#define GTZC_CFGR1_TIM1_Msk     ( 0x01UL << GTZC_CFGR1_TIM1_Pos )
#define GTZC_CFGR1_COMP_Pos     (29U)
#define GTZC_CFGR1_COMP_Msk     ( 0x01UL << GTZC_CFGR1_COMP_Pos )
#define GTZC_CFGR1_VREFBUF_Pos  (28U)
#define GTZC_CFGR1_VREFBUF_Msk  ( 0x01UL << GTZC_CFGR1_VREFBUF_Pos )
#define GTZC_CFGR1_UCPD1_Pos    (27U)
#define GTZC_CFGR1_UCPD1_Msk    ( 0x01UL << GTZC_CFGR1_UCPD1_Pos )
#define GTZC_CFGR1_USBFS_Pos    (26U)
#define GTZC_CFGR1_USBFS_Msk    ( 0x01UL << GTZC_CFGR1_USBFS_Pos )
#define GTZC_CFGR1_FDCAN1_Pos   (25U)
#define GTZC_CFGR1_FDCAN1_Msk   ( 0x01UL << GTZC_CFGR1_FDCAN1_Pos )
#define GTZC_CFGR1_LPTIM3_Pos   (24U)
#define GTZC_CFGR1_LPTIM3_Msk   ( 0x01UL << GTZC_CFGR1_LPTIM3_Pos )
#define GTZC_CFGR1_LPTIM2_Pos   (23U)
#define GTZC_CFGR1_LPTIM2_Msk   ( 0x01UL << GTZC_CFGR1_LPTIM2_Pos )
#define GTZC_CFGR1_I2C4_Pos     (22U)
#define GTZC_CFGR1_I2C4_Msk     ( 0x01UL << GTZC_CFGR1_I2C4_Pos )
#define GTZC_CFGR1_LPUART1_Pos  (21U)
#define GTZC_CFGR1_LPUART1_Msk  ( 0x01UL << GTZC_CFGR1_LPUART1_Pos )
#define GTZC_CFGR1_LPTIM1_Pos   (20U)
#define GTZC_CFGR1_LPTIM1_Msk   ( 0x01UL << GTZC_CFGR1_LPTIM1_Pos )
#define GTZC_CFGR1_OPAMP_Pos    (19U)
#define GTZC_CFGR1_OPAMP_Msk    ( 0x01UL << GTZC_CFGR1_OPAMP_Pos )
#define GTZC_CFGR1_DAC1_Pos     (18U)
#define GTZC_CFGR1_DAC1_Msk     ( 0x01UL << GTZC_CFGR1_DAC1_Pos )
#define GTZC_CFGR1_CRS_Pos      (17U)
#define GTZC_CFGR1_CRS_Msk      ( 0x01UL << GTZC_CFGR1_CRS_Pos )
#define GTZC_CFGR1_I2C3_Pos     (16U)
#define GTZC_CFGR1_I2C3_Msk     ( 0x01UL << GTZC_CFGR1_I2C3_Pos )
#define GTZC_CFGR1_I2C2_Pos     (15U)
#define GTZC_CFGR1_I2C2_Msk     ( 0x01UL << GTZC_CFGR1_I2C2_Pos )
#define GTZC_CFGR1_I2C1_Pos     (14U)
#define GTZC_CFGR1_I2C1_Msk     ( 0x01UL << GTZC_CFGR1_I2C1_Pos )
#define GTZC_CFGR1_UART5_Pos    (13U)
#define GTZC_CFGR1_UART5_Msk    ( 0x01UL << GTZC_CFGR1_UART5_Pos )
#define GTZC_CFGR1_UART4_Pos    (12U)
#define GTZC_CFGR1_UART4_Msk    ( 0x01UL << GTZC_CFGR1_UART4_Pos )
#define GTZC_CFGR1_USART3_Pos   (11U)
#define GTZC_CFGR1_USART3_Msk   ( 0x01UL << GTZC_CFGR1_USART3_Pos )
#define GTZC_CFGR1_USART2_Pos   (10U)
#define GTZC_CFGR1_USART2_Msk   ( 0x01UL << GTZC_CFGR1_USART2_Pos )
#define GTZC_CFGR1_SPI3_Pos     (9U)
#define GTZC_CFGR1_SPI3_Msk     ( 0x01UL << GTZC_CFGR1_SPI3_Pos )
#define GTZC_CFGR1_SPI2_Pos     (8U)
#define GTZC_CFGR1_SPI2_Msk     ( 0x01UL << GTZC_CFGR1_SPI2_Pos )
#define GTZC_CFGR1_IWDG_Pos     (7U)
#define GTZC_CFGR1_IWDG_Msk     ( 0x01UL << GTZC_CFGR1_IWDG_Pos )
#define GTZC_CFGR1_WWDG_Pos     (6U)
#define GTZC_CFGR1_WWDG_Msk     ( 0x01UL << GTZC_CFGR1_WWDG_Pos )
#define GTZC_CFGR1_TIM7_Pos     (5U)
#define GTZC_CFGR1_TIM7_Msk     ( 0x01UL << GTZC_CFGR1_TIM7_Pos )
#define GTZC_CFGR1_TIM6_Pos     (4U)
#define GTZC_CFGR1_TIM6_Msk     ( 0x01UL << GTZC_CFGR1_TIM6_Pos )
#define GTZC_CFGR1_TIM5_Pos     (3U)
#define GTZC_CFGR1_TIM5_Msk     ( 0x01UL << GTZC_CFGR1_TIM5_Pos )
#define GTZC_CFGR1_TIM4_Pos     (2U)
#define GTZC_CFGR1_TIM4_Msk     ( 0x01UL << GTZC_CFGR1_TIM4_Pos )
#define GTZC_CFGR1_TIM3_Pos     (1U)
#define GTZC_CFGR1_TIM3_Msk     ( 0x01UL << GTZC_CFGR1_TIM3_Pos )
#define GTZC_CFGR1_TIM2_Pos     (0U)
#define GTZC_CFGR1_TIM2_Msk     ( 0x01UL << GTZC_CFGR1_TIM2_Pos )

/*******************  Bits definition for registers x=2  ***************/
#define GTZC_CFGR2_EXTI_Pos          (28U)
#define GTZC_CFGR2_EXTI_Msk          ( 0x01UL << GTZC_CFGR2_EXTI_Pos )
#define GTZC_CFGR2_FLASH_REG_Pos     (27U)
#define GTZC_CFGR2_FLASH_REG_Msk     ( 0x01UL << GTZC_CFGR2_FLASH_REG_Pos )
#define GTZC_CFGR2_FLASH_Pos         (26U)
#define GTZC_CFGR2_FLASH_Msk         ( 0x01UL << GTZC_CFGR2_FLASH_Pos )
#define GTZC_CFGR2_RCC_Pos           (25U)
#define GTZC_CFGR2_RCC_Msk           ( 0x01UL << GTZC_CFGR2_RCC_Pos )
#define GTZC_CFGR2_DMAMUX1_Pos       (24U)
#define GTZC_CFGR2_DMAMUX1_Msk       ( 0x01UL << GTZC_CFGR2_DMAMUX1_Pos )
#define GTZC_CFGR2_DMA2_Pos          (23U)
#define GTZC_CFGR2_DMA2_Msk          ( 0x01UL << GTZC_CFGR2_DMA2_Pos )
#define GTZC_CFGR2_DMA1_Pos          (22U)
#define GTZC_CFGR2_DMA1_Msk          ( 0x01UL << GTZC_CFGR2_DMA1_Pos )
#define GTZC_CFGR2_SYSCFG_Pos        (21U)
#define GTZC_CFGR2_SYSCFG_Msk        ( 0x01UL << GTZC_CFGR2_SYSCFG_Pos )
#define GTZC_CFGR2_PWR_Pos           (20U)
#define GTZC_CFGR2_PWR_Msk           ( 0x01UL << GTZC_CFGR2_PWR_Pos )
#define GTZC_CFGR2_RTC_Pos           (19U)
#define GTZC_CFGR2_RTC_Msk           ( 0x01UL << GTZC_CFGR2_RTC_Pos )
#define GTZC_CFGR2_OCTOSPI1_REG_Pos  (18U)
#define GTZC_CFGR2_OCTOSPI1_REG_Msk  ( 0x01UL << GTZC_CFGR2_OCTOSPI1_REG_Pos )
#define GTZC_CFGR2_FMC_REG_Pos       (17U)
#define GTZC_CFGR2_FMC_REG_Msk       ( 0x01UL << GTZC_CFGR2_FMC_REG_Pos )
#define GTZC_CFGR2_SDMMC1_Pos        (16U)
#define GTZC_CFGR2_SDMMC1_Msk        ( 0x01UL << GTZC_CFGR2_SDMMC1_Pos )
#define GTZC_CFGR2_RNG_Pos           (14U)
#define GTZC_CFGR2_RNG_Msk           ( 0x01UL << GTZC_CFGR2_RNG_Pos )
#define GTZC_CFGR2_HASH_Pos          (13U)
#define GTZC_CFGR2_HASH_Msk          ( 0x01UL << GTZC_CFGR2_HASH_Pos )
#define GTZC_CFGR2_ADC_Pos           (11U)
#define GTZC_CFGR2_ADC_Msk           ( 0x01UL << GTZC_CFGR2_ADC_Pos )
#define GTZC_CFGR2_ICACHE_REG_Pos    (10U)
#define GTZC_CFGR2_ICACHE_REG_Msk    ( 0x01UL << GTZC_CFGR2_ICACHE_REG_Pos )
#define GTZC_CFGR2_TSC_Pos           (9U)
#define GTZC_CFGR2_TSC_Msk           ( 0x01UL << GTZC_CFGR2_TSC_Pos )
#define GTZC_CFGR2_CRC_Pos           (8U)
#define GTZC_CFGR2_CRC_Msk           ( 0x01UL << GTZC_CFGR2_CRC_Pos )
#define GTZC_CFGR2_DFSDM1_Pos        (7U)
#define GTZC_CFGR2_DFSDM1_Msk        ( 0x01UL << GTZC_CFGR2_DFSDM1_Pos )
#define GTZC_CFGR2_SAI2_Pos          (6U)
#define GTZC_CFGR2_SAI2_Msk          ( 0x01UL << GTZC_CFGR2_SAI2_Pos )
#define GTZC_CFGR2_SAI1_Pos          (5U)
#define GTZC_CFGR2_SAI1_Msk          ( 0x01UL << GTZC_CFGR2_SAI1_Pos )
#define GTZC_CFGR2_TIM17_Pos         (4U)
#define GTZC_CFGR2_TIM17_Msk         ( 0x01UL << GTZC_CFGR2_TIM17_Pos )
#define GTZC_CFGR2_TIM16_Pos         (3U)
#define GTZC_CFGR2_TIM16_Msk         ( 0x01UL << GTZC_CFGR2_TIM16_Pos )
#define GTZC_CFGR2_TIM15_Pos         (2U)
#define GTZC_CFGR2_TIM15_Msk         ( 0x01UL << GTZC_CFGR2_TIM15_Pos )
#define GTZC_CFGR2_USART1_Pos        (1U)
#define GTZC_CFGR2_USART1_Msk        ( 0x01UL << GTZC_CFGR2_USART1_Pos )
#define GTZC_CFGR2_TIM8_Pos          (0U)
#define GTZC_CFGR2_TIM8_Msk          ( 0x01UL << GTZC_CFGR2_TIM8_Pos )

/*******************  Bits definition for registers x=3  ***************/
#define GTZC_CFGR3_MPCBB2_REG_Pos  (7U)
#define GTZC_CFGR3_MPCBB2_REG_Msk  ( 0x01UL << GTZC_CFGR3_MPCBB2_REG_Pos )
#define GTZC_CFGR3_SRAM2_Pos       (6U)
#define GTZC_CFGR3_SRAM2_Msk       ( 0x01UL << GTZC_CFGR3_SRAM2_Pos )
#define GTZC_CFGR3_MPCBB1_REG_Pos  (5U)
#define GTZC_CFGR3_MPCBB1_REG_Msk  ( 0x01UL << GTZC_CFGR3_MPCBB1_REG_Pos )
#define GTZC_CFGR3_SRAM1_Pos       (4U)
#define GTZC_CFGR3_SRAM1_Msk       ( 0x01UL << GTZC_CFGR3_SRAM1_Pos )
#define GTZC_CFGR3_OCTOSPI1_MEM_Pos (3U)
#define GTZC_CFGR3_OCTOSPI1_MEM_Msk ( 0x01UL << GTZC_CFGR3_OCTOSPI1_MEM_Pos )
#define GTZC_CFGR3_FMC_MEM_Pos     (2U)
#define GTZC_CFGR3_FMC_MEM_Msk     ( 0x01UL << GTZC_CFGR3_FMC_MEM_Pos )
#define GTZC_CFGR3_TZIC_Pos        (1U)
#define GTZC_CFGR3_TZIC_Msk        ( 0x01UL << GTZC_CFGR3_TZIC_Pos )
#define GTZC_CFGR3_TZSC_Pos        (0U)
#define GTZC_CFGR3_TZSC_Msk        ( 0x01UL << GTZC_CFGR3_TZSC_Pos )

/*******************  Bits definition for GTZC_TZSC_SECCFGR1 register  ***************/
#define GTZC_TZSC_SECCFGR1_SPI1SEC_Pos           GTZC_CFGR1_SPI1_Pos
#define GTZC_TZSC_SECCFGR1_SPI1SEC_Msk           GTZC_CFGR1_SPI1_Msk
#define GTZC_TZSC_SECCFGR1_TIM1SEC_Pos           GTZC_CFGR1_TIM1_Pos
#define GTZC_TZSC_SECCFGR1_TIM1SEC_Msk           GTZC_CFGR1_TIM1_Msk
#define GTZC_TZSC_SECCFGR1_COMPSEC_Pos           GTZC_CFGR1_COMP_Pos
#define GTZC_TZSC_SECCFGR1_COMPSEC_Msk           GTZC_CFGR1_COMP_Msk
#define GTZC_TZSC_SECCFGR1_VREFBUFSEC_Pos        GTZC_CFGR1_VREFBUF_Pos
#define GTZC_TZSC_SECCFGR1_VREFBUFSEC_Msk        GTZC_CFGR1_VREFBUF_Msk
#define GTZC_TZSC_SECCFGR1_UCPD1SEC_Pos          GTZC_CFGR1_UCPD1_Pos
#define GTZC_TZSC_SECCFGR1_UCPD1SEC_Msk          GTZC_CFGR1_UCPD1_Msk
#define GTZC_TZSC_SECCFGR1_USBFSSEC_Pos          GTZC_CFGR1_USBFS_Pos
#define GTZC_TZSC_SECCFGR1_USBFSSEC_Msk          GTZC_CFGR1_USBFS_Msk
#define GTZC_TZSC_SECCFGR1_FDCAN1SEC_Pos         GTZC_CFGR1_FDCAN1_Pos
#define GTZC_TZSC_SECCFGR1_FDCAN1SEC_Msk         GTZC_CFGR1_FDCAN1_Msk
#define GTZC_TZSC_SECCFGR1_LPTIM3SEC_Pos         GTZC_CFGR1_LPTIM3_Pos
#define GTZC_TZSC_SECCFGR1_LPTIM3SEC_Msk         GTZC_CFGR1_LPTIM3_Msk
#define GTZC_TZSC_SECCFGR1_LPTIM2SEC_Pos         GTZC_CFGR1_LPTIM2_Pos
#define GTZC_TZSC_SECCFGR1_LPTIM2SEC_Msk         GTZC_CFGR1_LPTIM2_Msk
#define GTZC_TZSC_SECCFGR1_I2C4SEC_Pos           GTZC_CFGR1_I2C4_Pos
#define GTZC_TZSC_SECCFGR1_I2C4SEC_Msk           GTZC_CFGR1_I2C4_Msk
#define GTZC_TZSC_SECCFGR1_LPUART1SEC_Pos        GTZC_CFGR1_LPUART1_Pos
#define GTZC_TZSC_SECCFGR1_LPUART1SEC_Msk        GTZC_CFGR1_LPUART1_Msk
#define GTZC_TZSC_SECCFGR1_LPTIM1SEC_Pos         GTZC_CFGR1_LPTIM1_Pos
#define GTZC_TZSC_SECCFGR1_LPTIM1SEC_Msk         GTZC_CFGR1_LPTIM1_Msk
#define GTZC_TZSC_SECCFGR1_OPAMPSEC_Pos          GTZC_CFGR1_OPAMP_Pos
#define GTZC_TZSC_SECCFGR1_OPAMPSEC_Msk          GTZC_CFGR1_OPAMP_Msk
#define GTZC_TZSC_SECCFGR1_DAC1SEC_Pos           GTZC_CFGR1_DAC1_Pos
#define GTZC_TZSC_SECCFGR1_DAC1SEC_Msk           GTZC_CFGR1_DAC1_Msk
#define GTZC_TZSC_SECCFGR1_CRSSEC_Pos            GTZC_CFGR1_CRS_Pos
#define GTZC_TZSC_SECCFGR1_CRSSEC_Msk            GTZC_CFGR1_CRS_Msk
#define GTZC_TZSC_SECCFGR1_I2C3SEC_Pos           GTZC_CFGR1_I2C3_Pos
#define GTZC_TZSC_SECCFGR1_I2C3SEC_Msk           GTZC_CFGR1_I2C3_Msk
#define GTZC_TZSC_SECCFGR1_I2C2SEC_Pos           GTZC_CFGR1_I2C2_Pos
#define GTZC_TZSC_SECCFGR1_I2C2SEC_Msk           GTZC_CFGR1_I2C2_Msk
#define GTZC_TZSC_SECCFGR1_I2C1SEC_Pos           GTZC_CFGR1_I2C1_Pos
#define GTZC_TZSC_SECCFGR1_I2C1SEC_Msk           GTZC_CFGR1_I2C1_Msk
#define GTZC_TZSC_SECCFGR1_UART5SEC_Pos          GTZC_CFGR1_UART5_Pos
#define GTZC_TZSC_SECCFGR1_UART5SEC_Msk          GTZC_CFGR1_UART5_Msk
#define GTZC_TZSC_SECCFGR1_UART4SEC_Pos          GTZC_CFGR1_UART4_Pos
#define GTZC_TZSC_SECCFGR1_UART4SEC_Msk          GTZC_CFGR1_UART4_Msk
#define GTZC_TZSC_SECCFGR1_USART3SEC_Pos         GTZC_CFGR1_USART3_Pos
#define GTZC_TZSC_SECCFGR1_USART3SEC_Msk         GTZC_CFGR1_USART3_Msk
#define GTZC_TZSC_SECCFGR1_USART2SEC_Pos         GTZC_CFGR1_USART2_Pos
#define GTZC_TZSC_SECCFGR1_USART2SEC_Msk         GTZC_CFGR1_USART2_Msk
#define GTZC_TZSC_SECCFGR1_SPI3SEC_Pos           GTZC_CFGR1_SPI3_Pos
#define GTZC_TZSC_SECCFGR1_SPI3SEC_Msk           GTZC_CFGR1_SPI3_Msk
#define GTZC_TZSC_SECCFGR1_SPI2SEC_Pos           GTZC_CFGR1_SPI2_Pos
#define GTZC_TZSC_SECCFGR1_SPI2SEC_Msk           GTZC_CFGR1_SPI2_Msk
#define GTZC_TZSC_SECCFGR1_IWDGSEC_Pos           GTZC_CFGR1_IWDG_Pos
#define GTZC_TZSC_SECCFGR1_IWDGSEC_Msk           GTZC_CFGR1_IWDG_Msk
#define GTZC_TZSC_SECCFGR1_WWDGSEC_Pos           GTZC_CFGR1_WWDG_Pos
#define GTZC_TZSC_SECCFGR1_WWDGSEC_Msk           GTZC_CFGR1_WWDG_Msk
#define GTZC_TZSC_SECCFGR1_TIM7SEC_Pos           GTZC_CFGR1_TIM7_Pos
#define GTZC_TZSC_SECCFGR1_TIM7SEC_Msk           GTZC_CFGR1_TIM7_Msk
#define GTZC_TZSC_SECCFGR1_TIM6SEC_Pos           GTZC_CFGR1_TIM6_Pos
#define GTZC_TZSC_SECCFGR1_TIM6SEC_Msk           GTZC_CFGR1_TIM6_Msk
#define GTZC_TZSC_SECCFGR1_TIM5SEC_Pos           GTZC_CFGR1_TIM5_Pos
#define GTZC_TZSC_SECCFGR1_TIM5SEC_Msk           GTZC_CFGR1_TIM5_Msk
#define GTZC_TZSC_SECCFGR1_TIM4SEC_Pos           GTZC_CFGR1_TIM4_Pos
#define GTZC_TZSC_SECCFGR1_TIM4SEC_Msk           GTZC_CFGR1_TIM4_Msk
#define GTZC_TZSC_SECCFGR1_TIM3SEC_Pos           GTZC_CFGR1_TIM3_Pos
#define GTZC_TZSC_SECCFGR1_TIM3SEC_Msk           GTZC_CFGR1_TIM3_Msk
#define GTZC_TZSC_SECCFGR1_TIM2SEC_Pos           GTZC_CFGR1_TIM2_Pos
#define GTZC_TZSC_SECCFGR1_TIM2SEC_Msk           GTZC_CFGR1_TIM2_Msk

