ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32L5xx/stm32l552xx.h
/*******************  Bits definition for GTZC_MPCBB_LCKVTR2 register  ************/
#define GTZC_MPCBB_LCKVTR2_LCKSB32_Pos  (0U)
#define GTZC_MPCBB_LCKVTR2_LCKSB32_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB32_Msk)  /*!< 0x00000001 */
#define GTZC_MPCBB_LCKVTR2_LCKSB33_Pos  (1U)
#define GTZC_MPCBB_LCKVTR2_LCKSB33_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB33_Pos)   /*!< 0x00000002 */
#define GTZC_MPCBB_LCKVTR2_LCKSB34_Pos  (2U)
#define GTZC_MPCBB_LCKVTR2_LCKSB34_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB34_Pos)   /*!< 0x00000004 */
#define GTZC_MPCBB_LCKVTR2_LCKSB35_Pos  (3U)
#define GTZC_MPCBB_LCKVTR2_LCKSB35_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB35_Pos)   /*!< 0x00000008 */
#define GTZC_MPCBB_LCKVTR2_LCKSB36_Pos  (4U)
#define GTZC_MPCBB_LCKVTR2_LCKSB36_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB36_Pos)   /*!< 0x00000010 */
#define GTZC_MPCBB_LCKVTR2_LCKSB37_Pos  (5U)
#define GTZC_MPCBB_LCKVTR2_LCKSB37_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB37_Pos)   /*!< 0x00000020 */
#define GTZC_MPCBB_LCKVTR2_LCKSB38_Pos  (6U)
#define GTZC_MPCBB_LCKVTR2_LCKSB38_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB38_Pos)   /*!< 0x00000040 */
#define GTZC_MPCBB_LCKVTR2_LCKSB39_Pos  (7U)
#define GTZC_MPCBB_LCKVTR2_LCKSB39_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB39_Pos)   /*!< 0x00000080 */
#define GTZC_MPCBB_LCKVTR2_LCKSB40_Pos  (8U)
#define GTZC_MPCBB_LCKVTR2_LCKSB40_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB40_Pos)   /*!< 0x00000100 */
#define GTZC_MPCBB_LCKVTR2_LCKSB41_Pos  (9U)
#define GTZC_MPCBB_LCKVTR2_LCKSB41_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB41_Pos)   /*!< 0x00000200 */
#define GTZC_MPCBB_LCKVTR2_LCKSB42_Pos  (10U)
#define GTZC_MPCBB_LCKVTR2_LCKSB42_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB42_Pos)   /*!< 0x00000400 */
#define GTZC_MPCBB_LCKVTR2_LCKSB43_Pos  (11U)
#define GTZC_MPCBB_LCKVTR2_LCKSB43_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB43_Pos)   /*!< 0x00000800 */
#define GTZC_MPCBB_LCKVTR2_LCKSB44_Pos  (12U)
#define GTZC_MPCBB_LCKVTR2_LCKSB44_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB44_Pos)   /*!< 0x00001000 */
#define GTZC_MPCBB_LCKVTR2_LCKSB45_Pos  (13U)
#define GTZC_MPCBB_LCKVTR2_LCKSB45_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB45_Pos)   /*!< 0x00002000 */
#define GTZC_MPCBB_LCKVTR2_LCKSB46_Pos  (14U)
#define GTZC_MPCBB_LCKVTR2_LCKSB46_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB46_Pos)   /*!< 0x00004000 */
#define GTZC_MPCBB_LCKVTR2_LCKSB47_Pos  (15U)
#define GTZC_MPCBB_LCKVTR2_LCKSB47_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB47_Pos)   /*!< 0x00008000 */
#define GTZC_MPCBB_LCKVTR2_LCKSB48_Pos  (16U)
#define GTZC_MPCBB_LCKVTR2_LCKSB48_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB48_Pos)   /*!< 0x00010000 */
#define GTZC_MPCBB_LCKVTR2_LCKSB49_Pos  (17U)
#define GTZC_MPCBB_LCKVTR2_LCKSB49_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB49_Pos)   /*!< 0x00020000 */
#define GTZC_MPCBB_LCKVTR2_LCKSB50_Pos  (18U)
#define GTZC_MPCBB_LCKVTR2_LCKSB50_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB50_Pos)   /*!< 0x00040000 */
#define GTZC_MPCBB_LCKVTR2_LCKSB51_Pos  (19U)
#define GTZC_MPCBB_LCKVTR2_LCKSB51_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB51_Pos)   /*!< 0x00080000 */
#define GTZC_MPCBB_LCKVTR2_LCKSB52_Pos  (20U)
#define GTZC_MPCBB_LCKVTR2_LCKSB52_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB52_Pos)   /*!< 0x00100000 */
#define GTZC_MPCBB_LCKVTR2_LCKSB53_Pos  (21U)
#define GTZC_MPCBB_LCKVTR2_LCKSB53_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB53_Pos)   /*!< 0x00200000 */
#define GTZC_MPCBB_LCKVTR2_LCKSB54_Pos  (22U)
#define GTZC_MPCBB_LCKVTR2_LCKSB54_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB54_Pos)   /*!< 0x00400000 */
#define GTZC_MPCBB_LCKVTR2_LCKSB55_Pos  (23U)
#define GTZC_MPCBB_LCKVTR2_LCKSB55_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB55_Pos)   /*!< 0x00800000 */
#define GTZC_MPCBB_LCKVTR2_LCKSB56_Pos  (24U)
#define GTZC_MPCBB_LCKVTR2_LCKSB56_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB56_Pos)   /*!< 0x01000000 */
#define GTZC_MPCBB_LCKVTR2_LCKSB57_Pos  (25U)
#define GTZC_MPCBB_LCKVTR2_LCKSB57_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB57_Pos)   /*!< 0x02000000 */
#define GTZC_MPCBB_LCKVTR2_LCKSB58_Pos  (26U)
#define GTZC_MPCBB_LCKVTR2_LCKSB58_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB58_Pos)   /*!< 0x04000000 */
#define GTZC_MPCBB_LCKVTR2_LCKSB59_Pos  (27U)
#define GTZC_MPCBB_LCKVTR2_LCKSB59_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB59_Pos)   /*!< 0x08000000 */
#define GTZC_MPCBB_LCKVTR2_LCKSB60_Pos  (28U)
#define GTZC_MPCBB_LCKVTR2_LCKSB60_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB60_Pos)   /*!< 0x10000000 */
#define GTZC_MPCBB_LCKVTR2_LCKSB61_Pos  (29U)
#define GTZC_MPCBB_LCKVTR2_LCKSB61_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB61_Pos)   /*!< 0x20000000 */
#define GTZC_MPCBB_LCKVTR2_LCKSB62_Pos  (30U)
#define GTZC_MPCBB_LCKVTR2_LCKSB62_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB62_Pos)   /*!< 0x40000000 */
#define GTZC_MPCBB_LCKVTR2_LCKSB63_Pos  (31U)
#define GTZC_MPCBB_LCKVTR2_LCKSB63_Msk  (0x01UL << GTZC_MPCBB_LCKVTR2_LCKSB63_Pos)   /*!< 0x80000000 */

/******************************************************************************/
/*                                                                            */
/*                           SDMMC Interface                                  */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for SDMMC_POWER register  ******************/
#define SDMMC_POWER_PWRCTRL_Pos         (0U)
#define SDMMC_POWER_PWRCTRL_Msk         (0x3UL << SDMMC_POWER_PWRCTRL_Pos)     /*!< 0x00000003 */
#define SDMMC_POWER_PWRCTRL             SDMMC_POWER_PWRCTRL_Msk                /*!<PWRCTRL[1:0] bits (Power supply control bits) */
#define SDMMC_POWER_PWRCTRL_0           (0x1UL << SDMMC_POWER_PWRCTRL_Pos)     /*!< 0x00000001 */
#define SDMMC_POWER_PWRCTRL_1           (0x2UL << SDMMC_POWER_PWRCTRL_Pos)     /*!< 0x00000002 */
#define SDMMC_POWER_VSWITCH_Pos         (2U)
#define SDMMC_POWER_VSWITCH_Msk         (0x1UL << SDMMC_POWER_VSWITCH_Pos)     /*!< 0x00000004 */
#define SDMMC_POWER_VSWITCH             SDMMC_POWER_VSWITCH_Pos                /*!<Voltage switch sequence start */
#define SDMMC_POWER_VSWITCHEN_Pos       (3U)
#define SDMMC_POWER_VSWITCHEN_Msk       (0x1UL << SDMMC_POWER_VSWITCHEN_Pos)   /*!< 0x00000008 */
#define SDMMC_POWER_VSWITCHEN           SDMMC_POWER_VSWITCHEN_Pos              /*!<Voltage switch procedure enable */
#define SDMMC_POWER_DIRPOL_Pos          (4U)
#define SDMMC_POWER_DIRPOL_Msk          (0x1UL << SDMMC_POWER_DIRPOL_Pos)      /*!< 0x00000010 */
#define SDMMC_POWER_DIRPOL              SDMMC_POWER_DIRPOL_Pos                 /*!<Data and Command direction signals polarity selection */

/******************  Bit definition for SDMMC_CLKCR register  ******************/
#define SDMMC_CLKCR_CLKDIV_Pos          (0U)
#define SDMMC_CLKCR_CLKDIV_Msk          (0x3FFUL << SDMMC_CLKCR_CLKDIV_Pos)    /*!< 0x000003FF */
#define SDMMC_CLKCR_CLKDIV              SDMMC_CLKCR_CLKDIV_Msk                 /*!<Clock divide factor             */
#define SDMMC_CLKCR_PWRSAV_Pos          (12U)
#define SDMMC_CLKCR_PWRSAV_Msk          (0x1UL << SDMMC_CLKCR_PWRSAV_Pos)      /*!< 0x00001000 */
#define SDMMC_CLKCR_PWRSAV              SDMMC_CLKCR_PWRSAV_Msk                 /*!<Power saving configuration bit  */

#define SDMMC_CLKCR_WIDBUS_Pos          (14U)
#define SDMMC_CLKCR_WIDBUS_Msk          (0x3UL << SDMMC_CLKCR_WIDBUS_Pos)      /*!< 0x0000C000 */
#define SDMMC_CLKCR_WIDBUS              SDMMC_CLKCR_WIDBUS_Msk                 /*!<WIDBUS[1:0] bits (Wide bus mode enable bit) */
#define SDMMC_CLKCR_WIDBUS_0            (0x1UL << SDMMC_CLKCR_WIDBUS_Pos)      /*!< 0x00000800 */
#define SDMMC_CLKCR_WIDBUS_1            (0x2UL << SDMMC_CLKCR_WIDBUS_Pos)      /*!< 0x00001000 */

#define SDMMC_CLKCR_NEGEDGE_Pos         (16U)
#define SDMMC_CLKCR_NEGEDGE_Msk         (0x1UL << SDMMC_CLKCR_NEGEDGE_Pos)     /*!< 0x00010000 */
#define SDMMC_CLKCR_NEGEDGE             SDMMC_CLKCR_NEGEDGE_Msk                /*!<SDMMC_CK dephasing selection bit */
#define SDMMC_CLKCR_HWFC_EN_Pos         (17U)
#define SDMMC_CLKCR_HWFC_EN_Msk         (0x1UL << SDMMC_CLKCR_HWFC_EN_Pos)     /*!< 0x00020000 */
#define SDMMC_CLKCR_HWFC_EN             SDMMC_CLKCR_HWFC_EN_Msk                /*!<HW Flow Control enable          */
#define SDMMC_CLKCR_DDR_Pos             (18U)
#define SDMMC_CLKCR_DDR_Msk             (0x1UL << SDMMC_CLKCR_DDR_Pos)         /*!< 0x00040000 */
#define SDMMC_CLKCR_DDR                 SDMMC_CLKCR_DDR_Msk                    /*!<Data rate signaling selection    */
#define SDMMC_CLKCR_BUSSPEED_Pos        (19U)
#define SDMMC_CLKCR_BUSSPEED_Msk        (0x1UL << SDMMC_CLKCR_BUSSPEED_Pos)    /*!< 0x00080000 */
#define SDMMC_CLKCR_BUSSPEED            SDMMC_CLKCR_BUSSPEED_Msk               /*!<Bus speed mode selection         */

#define SDMMC_CLKCR_SELCLKRX_Pos        (20U)
#define SDMMC_CLKCR_SELCLKRX_Msk        (0x3UL << SDMMC_CLKCR_SELCLKRX_Pos)    /*!< 0x00300000 */
#define SDMMC_CLKCR_SELCLKRX            SDMMC_CLKCR_SELCLKRX_Msk               /*!<SELCLKRX[1:0] bits (Receive clock selection) */
#define SDMMC_CLKCR_SELCLKRX_0          (0x1UL << SDMMC_CLKCR_SELCLKRX_Pos)    /*!< 0x00100000 */
#define SDMMC_CLKCR_SELCLKRX_1          (0x2UL << SDMMC_CLKCR_SELCLKRX_Pos)    /*!< 0x00200000 */

