ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32L5xx/stm32l552xx.h
/******************************* GPIO Instances *******************************/
#define IS_GPIO_ALL_INSTANCE(INSTANCE) (((INSTANCE) == GPIOA_S) || \
                                        ((INSTANCE) == GPIOB_S) || \
                                        ((INSTANCE) == GPIOC_S) || \
                                        ((INSTANCE) == GPIOD_S) || \
                                        ((INSTANCE) == GPIOE_S) || \
                                        ((INSTANCE) == GPIOF_S) || \
                                        ((INSTANCE) == GPIOG_S) || \
                                        ((INSTANCE) == GPIOH_S))

/******************************* GPIO AF Instances ****************************/
/* All GPIO Banks support AF */
#define IS_GPIO_AF_INSTANCE(INSTANCE)   IS_GPIO_ALL_INSTANCE(INSTANCE)

/**************************** GPIO Lock Instances *****************************/
/* All GPIO Banks support the Lock mechanism */
#define IS_GPIO_LOCK_INSTANCE(INSTANCE) IS_GPIO_ALL_INSTANCE(INSTANCE)

/******************************** I2C Instances *******************************/
#define IS_I2C_ALL_INSTANCE(INSTANCE) (((INSTANCE) == I2C1_S) || \
                                       ((INSTANCE) == I2C2_S) || \
                                       ((INSTANCE) == I2C3_S) || \
                                       ((INSTANCE) == I2C4_S))

/****************** I2C Instances : wakeup capability from stop modes *********/
#define IS_I2C_WAKEUP_FROMSTOP_INSTANCE(INSTANCE) IS_I2C_ALL_INSTANCE(INSTANCE)

/****************************** OPAMP Instances *******************************/
#define IS_OPAMP_ALL_INSTANCE(INSTANCE) (((INSTANCE) == OPAMP1_S) || \
                                         ((INSTANCE) == OPAMP2_S))

#define IS_OPAMP_COMMON_INSTANCE(COMMON_INSTANCE) ((COMMON_INSTANCE) == OPAMP12_COMMON_S)

/******************************* OSPI Instances *******************************/
#define IS_OSPI_ALL_INSTANCE(INSTANCE) ((INSTANCE) == OCTOSPI1_S)

/******************************* RNG Instances ********************************/
#define IS_RNG_ALL_INSTANCE(INSTANCE) ((INSTANCE) == RNG_S)

/****************************** RTC Instances *********************************/
#define IS_RTC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == RTC_S)

/******************************** SAI Instances *******************************/
#define IS_SAI_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SAI1_Block_A_S) || \
                                       ((INSTANCE) == SAI1_Block_B_S) || \
                                       ((INSTANCE) == SAI2_Block_A_S) || \
                                       ((INSTANCE) == SAI2_Block_B_S))

/****************************** SDMMC Instances *******************************/
#define IS_SDMMC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == SDMMC1_S)

/****************************** SMBUS Instances *******************************/
#define IS_SMBUS_ALL_INSTANCE(INSTANCE) IS_I2C_ALL_INSTANCE(INSTANCE)

/******************************** SPI Instances *******************************/
#define IS_SPI_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SPI1_S) || \
                                       ((INSTANCE) == SPI2_S) || \
                                       ((INSTANCE) == SPI3_S))

/****************** LPTIM Instances : All supported instances *****************/
#define IS_LPTIM_INSTANCE(INSTANCE)     (((INSTANCE) == LPTIM1_S) || \
                                         ((INSTANCE) == LPTIM2_S) || \
                                         ((INSTANCE) == LPTIM3_S))

#define IS_LPTIM_ENCODER_INTERFACE_INSTANCE(INSTANCE) ((INSTANCE) == LPTIM1_S)

/****************** TIM Instances : All supported instances *******************/
#define IS_TIM_INSTANCE(INSTANCE)       (((INSTANCE) == TIM1_S)  || \
                                         ((INSTANCE) == TIM2_S)  || \
                                         ((INSTANCE) == TIM3_S)  || \
                                         ((INSTANCE) == TIM4_S)  || \
                                         ((INSTANCE) == TIM5_S)  || \
                                         ((INSTANCE) == TIM6_S)  || \
                                         ((INSTANCE) == TIM7_S)  || \
                                         ((INSTANCE) == TIM8_S)  || \
                                         ((INSTANCE) == TIM15_S) || \
                                         ((INSTANCE) == TIM16_S) || \
                                         ((INSTANCE) == TIM17_S))

/****************** TIM Instances : supporting 32 bits counter ****************/
#define IS_TIM_32B_COUNTER_INSTANCE(INSTANCE) (((INSTANCE) == TIM2_S)  || \
                                               ((INSTANCE) == TIM5_S))

/****************** TIM Instances : supporting the break function *************/
#define IS_TIM_BREAK_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1_S)  || \
                                            ((INSTANCE) == TIM8_S)  || \
                                            ((INSTANCE) == TIM15_S) || \
                                            ((INSTANCE) == TIM16_S) || \
                                            ((INSTANCE) == TIM17_S))

/************** TIM Instances : supporting Break source selection *************/
#define IS_TIM_BREAKSOURCE_INSTANCE(INSTANCE) (((INSTANCE) == TIM1_S)  || \
                                               ((INSTANCE) == TIM8_S)  || \
                                               ((INSTANCE) == TIM15_S) || \
                                               ((INSTANCE) == TIM16_S) || \
                                               ((INSTANCE) == TIM17_S))

/****************** TIM Instances : supporting 2 break inputs *****************/
#define IS_TIM_BKIN2_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1_S)  || \
                                            ((INSTANCE) == TIM8_S))

/************* TIM Instances : at least 1 capture/compare channel *************/
#define IS_TIM_CC1_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_S)  || \
                                         ((INSTANCE) == TIM2_S)  || \
                                         ((INSTANCE) == TIM3_S)  || \
                                         ((INSTANCE) == TIM4_S)  || \
                                         ((INSTANCE) == TIM5_S)  || \
                                         ((INSTANCE) == TIM8_S)  || \
                                         ((INSTANCE) == TIM15_S) || \
                                         ((INSTANCE) == TIM16_S) || \
                                         ((INSTANCE) == TIM17_S))

