ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32L5xx/stm32l552xx.h
/****************** UART Instances : Hardware Flow control ********************/
#define IS_UART_HWFLOW_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S)  || \
                                           ((INSTANCE) == USART2_S)  || \
                                           ((INSTANCE) == USART3_S)  || \
                                           ((INSTANCE) == UART4_S)   || \
                                           ((INSTANCE) == UART5_S)   || \
                                           ((INSTANCE) == LPUART1_S))

/******************** UART Instances : LIN mode **********************/
#define IS_UART_LIN_INSTANCE(INSTANCE)   (((INSTANCE) == USART1_S) || \
                                          ((INSTANCE) == USART2_S) || \
                                          ((INSTANCE) == USART3_S) || \
                                          ((INSTANCE) == UART4_S)  || \
                                          ((INSTANCE) == UART5_S))

/******************** UART Instances : Wake-up from Stop mode **********************/
#define IS_UART_WAKEUP_FROMSTOP_INSTANCE(INSTANCE)   (((INSTANCE) == USART1_S)  || \
                                                      ((INSTANCE) == USART2_S)  || \
                                                      ((INSTANCE) == USART3_S)  || \
                                                      ((INSTANCE) == UART4_S)   || \
                                                      ((INSTANCE) == UART5_S)   || \
                                                      ((INSTANCE) == LPUART1_S))

/*********************** UART Instances : IRDA mode ***************************/
#define IS_IRDA_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S) || \
                                    ((INSTANCE) == USART2_S) || \
                                    ((INSTANCE) == USART3_S) || \
                                    ((INSTANCE) == UART4_S)  || \
                                    ((INSTANCE) == UART5_S))

/********************* USART Instances : Smard card mode ***********************/
#define IS_SMARTCARD_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S) || \
                                         ((INSTANCE) == USART2_S) || \
                                         ((INSTANCE) == USART3_S))

/******************** LPUART Instance *****************************************/
#define IS_LPUART_INSTANCE(INSTANCE)    ((INSTANCE) == LPUART1_S)

/****************************** IWDG Instances ********************************/
#define IS_IWDG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == IWDG_S)

/****************************** WWDG Instances ********************************/
#define IS_WWDG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == WWDG_S)

/****************************** UCPD Instances ********************************/
#define IS_UCPD_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == UCPD1_S)

/******************************* USB Instances ********************************/
#define IS_USB_ALL_INSTANCE(INSTANCE)   ((INSTANCE) == USB_S)
#define IS_PCD_ALL_INSTANCE             IS_USB_ALL_INSTANCE

#else
/* Instances allowed from Non-Secure state - only alias Non-Secure */

/******************************* ADC Instances ********************************/
#define IS_ADC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == ADC1_NS) || \
                                       ((INSTANCE) == ADC2_NS))

#define IS_ADC_MULTIMODE_MASTER_INSTANCE(INSTANCE) ((INSTANCE) == ADC1_NS)

#define IS_ADC_COMMON_INSTANCE(INSTANCE) ((INSTANCE) == ADC12_COMMON_NS)

/******************************** FDCAN Instances *****************************/
#define IS_FDCAN_ALL_INSTANCE(INSTANCE) ((INSTANCE) == FDCAN1_NS)

#define IS_FDCAN_CONFIG_INSTANCE(INSTANCE) ((INSTANCE) == FDCAN_CONFIG_NS)

/******************************** COMP Instances ******************************/
#define IS_COMP_ALL_INSTANCE(INSTANCE) (((INSTANCE) == COMP1_NS) || \
                                        ((INSTANCE) == COMP2_NS))

#define IS_COMP_COMMON_INSTANCE(COMMON_INSTANCE) ((COMMON_INSTANCE) == COMP12_COMMON_NS)

/******************** COMP Instances with window mode capability **************/
#define IS_COMP_WINDOWMODE_INSTANCE(INSTANCE) ((INSTANCE) == COMP2_NS)

/******************************* CRC Instances ********************************/
#define IS_CRC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == CRC_NS)

/******************************* DAC Instances ********************************/
#define IS_DAC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DAC1_NS)

/****************************** DFSDM Instances *******************************/
#define IS_DFSDM_FILTER_ALL_INSTANCE(INSTANCE) (((INSTANCE) == DFSDM1_Filter0_NS) || \
                                                ((INSTANCE) == DFSDM1_Filter1_NS) || \
                                                ((INSTANCE) == DFSDM1_Filter2_NS) || \
                                                ((INSTANCE) == DFSDM1_Filter3_NS))

#define IS_DFSDM_CHANNEL_ALL_INSTANCE(INSTANCE) (((INSTANCE) == DFSDM1_Channel0_NS) || \
                                                 ((INSTANCE) == DFSDM1_Channel1_NS) || \
                                                 ((INSTANCE) == DFSDM1_Channel2_NS) || \
                                                 ((INSTANCE) == DFSDM1_Channel3_NS))

/******************************** DMA Instances *******************************/
#define IS_DMA_ALL_INSTANCE(INSTANCE) (((INSTANCE) == DMA1_Channel1_NS) || \
                                       ((INSTANCE) == DMA1_Channel2_NS) || \
                                       ((INSTANCE) == DMA1_Channel3_NS) || \
                                       ((INSTANCE) == DMA1_Channel4_NS) || \
                                       ((INSTANCE) == DMA1_Channel5_NS) || \
                                       ((INSTANCE) == DMA1_Channel6_NS) || \
                                       ((INSTANCE) == DMA1_Channel7_NS) || \
                                       ((INSTANCE) == DMA1_Channel8_NS) || \
                                       ((INSTANCE) == DMA2_Channel1_NS) || \
                                       ((INSTANCE) == DMA2_Channel2_NS) || \
                                       ((INSTANCE) == DMA2_Channel3_NS) || \
                                       ((INSTANCE) == DMA2_Channel4_NS) || \
                                       ((INSTANCE) == DMA2_Channel5_NS) || \
                                       ((INSTANCE) == DMA2_Channel6_NS) || \
                                       ((INSTANCE) == DMA2_Channel7_NS) || \
                                       ((INSTANCE) == DMA2_Channel8_NS))

